[
    {
        "image": "http://img.lum.dolimg.com/v1/images/curve_4lom_a7640432.jpeg?region=0%2C15%2C230%2C171",
        "name": "4-LOM",
        "slug": "4-lom",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "A rusty droid with insectile features, 4-LOM was originally a protocol droid, but logic glitches allowed him to escape his programming and become a bounty hunter. That proved a perfect occupation for the cold, calculating mechanical.",
        "databank_url": "http://starwars.wikia.com/wiki/4-LOM"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/8d8-main-image_4643541d.jpeg?region=141%2C0%2C883%2C663",
        "name": "8D8",
        "slug": "8d8",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A lanky smelter droid, 8D8 assisted EV-9D9 in terrorizing Jabba the Hutt's droid pool. Normally limited to simple tasks in the harsh confines of ore-extraction facilities, 8D8 had been reprogrammed for sadism.",
        "databank_url": "http://starwars.wikia.com/wiki/8D8"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_aaylasecura_01_169_39a65af2.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Aayla Secura",
        "slug": "aayla-secura",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "With an athletic build, an exotic beauty, and blue skin, Aayla Secura stood out among the many faces of the Jedi ranks. A cunning warrior and Jedi Knight during the rise of the Clone Wars, Aayla fought alongside Clone Commander Bly on many exotic battlefields. Having mastered the emotional detachment necessary in the Jedi Order, she always tried to pass on what she had learned to others. Aayla was killed, along with many other Jedi Generals, when her troops turned on her in reaction to Supreme Chancellor Palpatine’s broadcast of Order 66.",
        "databank_url": "http://starwars.wikia.com/wiki/Aayla_Secura"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_adigallia_169_8b798f27.jpeg?region=114%2C0%2C1170%2C878",
        "name": "Adi Gallia",
        "slug": "adi-gallia",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "Jedi Master Adi Gallia was a member of the Order's High Council during the Clone Wars. She and the other members of that ruling body would convene in a temple high above the Coruscant landscape, deciding important matters of the Jedi. Stern and focused, she would remark upon the more outrageous tactics carried out by Anakin Skywalker or Obi-Wan Kenobi in the course of the war, but would rarely condemn their effective actions. Though not as brash as Anakin, Adi Gallia was known to be an aggressive warrior who had no problem bringing the fight to the enemy.",
        "databank_url": "http://starwars.wikia.com/wiki/Adi_Gallia"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_ackbar_01_169_55137220.jpeg?region=68%2C0%2C1170%2C878",
        "name": "Admiral Ackbar",
        "slug": "admiral-ackbar",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode VII The Force Awakens",
            "Star Wars: The Clone Wars"
        ],
        "description": "A veteran commander, Ackbar led the defense of his homeworld, Mon Cala, during the Clone Wars and then masterminded the rebel attack on the second Death Star at the Battle of Endor. Ackbar realized the rebels had been drawn into a trap at Endor, but adjusted, with his fleet buying valuable time for the attack to succeed. After the Battle of Endor, Ackbar became a Grand Admiral in the New Republic, winning many victories including the pivotal Battle of Jakku. He retired to Mon Cala, but was coaxed back into service with the Resistance by Leia Organa.",
        "databank_url": "http://starwars.wikia.com/wiki/Admiral_Ackbar"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_admiralmotti_01_169_f01d2570.jpeg?region=260%2C0%2C1170%2C878",
        "name": "Admiral Motti",
        "slug": "admiral-motti",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "Admiral Motti was a young, ambitious Imperial officer who extolled the Death Star as the ultimate power in the universe, and burned to use the battle station against the Rebellion and any who dared to challenge Imperial power. An ally of Grand Moff Tarkin's, Motti loved technology above all else, particularly when it was used to create devastating superweapons. He died when the Death Star was destroyed.",
        "databank_url": "http://starwars.wikia.com/wiki/Admiral_Motti"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/e5d_ia_1189_6c16bed1.jpeg?region=0%2C0%2C1080%2C809",
        "name": "Admiral Ozzel",
        "slug": "admiral-ozzel",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "Admiral Ozzel commanded the Super Star Destroyer Executor, Darth Vader's mighty flagship and the linchpin of the squadron searching the galaxy for the Alliance's secret base. Ozzel led the initial attack on Hoth, but his choice of tactics infuriated Vader, leading to a sudden and permanent demotion.",
        "databank_url": "http://starwars.wikia.com/wiki/Admiral_Ozzel"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_admiralpiett_01_169_18014135.jpeg?region=271%2C0%2C1170%2C878",
        "name": "Admiral Piett",
        "slug": "admiral-piett",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "An ambitious Imperial officer, Piett rose through the ranks to captain and was assigned to the Super Star Destroyer Executor, Darth Vader's flagship. There, he chafed at having to serve under the foolish, vainglorious Admiral Ozzel. When Vader strangled Ozzel, Piett was granted a battlefield promotion to admiral -- and given a grisly warning of the penalty for failure. Miraculously, he survived his time as Vader's underling, but died when a Rebel starfighter destroyed the Executor's command bridge.",
        "databank_url": "http://starwars.wikia.com/wiki/Admiral_Piett"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_admiraltrench_01_169_b05dd531.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Admiral Trench",
        "slug": "admiral-trench",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "A Separatist admiral known for his cunning and ruthlessness, Trench commanded the Separatist blockade of Christophsis, where Senator Bail Organa and his relief effort were pinned down and in danger of capture.    Anakin Skywalker sought to break Trench's blockade by attacking his flagship with a cloaked stealth ship created by Republic engineers.",
        "databank_url": "http://starwars.wikia.com/wiki/Admiral_Trench"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_admiralwulffyularen_01_169_b3e1285c.jpeg?region=98%2C0%2C1169%2C878",
        "name": "Admiral Wullf Yularen",
        "slug": "admiral-wullf-yularen",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: The Clone Wars"
        ],
        "description": "An admiral in the Republic's service, Yularen served gallantly in the Clone Wars, commanding a Jedi Cruiser in many campaigns against Separatist forces. Yularen was assigned to serve with the Jedi General Anakin Skywalker, and the rigid officer and the impulsive Jedi made for an odd combination. Yularen admired Anakin's bravery and instincts in battle while deploring his recklessness and willingness to interpret orders creatively -- or ignore them altogether.",
        "databank_url": "http://starwars.wikia.com/wiki/Admiral_Wullf_Yularen"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/screen_shot_2015-05-26_at_5_9f577251.png?region=0%2C22%2C943%2C707",
        "name": "Agen Kolar",
        "slug": "agen-kolar",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A Zabrak Jedi Master, Agen Kolar was part of the Jedi strike team assembled by Mace Windu to rescue Obi-Wan Kenobi and other hostages taken by the Separatists on Geonosis. Kolar displayed his renowned skill with a lightsaber during the battle in the Geonosian arena, though his young Padawan died during the fighting. In the final days of the Clone Wars, Windu turned to Kolar again, calling on him, Saesee Tiin and Kit Fisto to arrest Supreme Chancellor Palpatine. Confronted by the Jedi, Palpatine threw off his guise and revealed himself as Darth Sidious. He ignited his crimson-bladed lightsaber and struck down Kolar.",
        "databank_url": "http://starwars.wikia.com/wiki/Agen_Kolar"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Anakin-Skywalker_d3330724.jpeg?region=119%2C0%2C900%2C675",
        "name": "Anakin Skywalker",
        "slug": "anakin-skywalker",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Discovered as a slave on Tatooine by Qui-Gon Jinn and Obi-Wan Kenobi, Anakin Skywalker had the potential to become one of the most powerful Jedi ever, and was believed by some to be the prophesied Chosen One who would bring balance to the Force. A hero of the Clone Wars, Anakin was caring and compassionate, but also had a fear of loss that would prove to be his downfall.",
        "databank_url": "http://starwars.wikia.com/wiki/Anakin_Skywalker"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Appo-main-image_653bd25a.jpeg?region=0%2C0%2C1264%2C949",
        "name": "Appo",
        "slug": "appo",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A clone trooper in Republic service, Appo took part in a number of critical battles during the fight against the Separatists. As a sergeant, he served under General Pong Krell on Umbara, and saw firsthand Krell’s willingness to throw away the lives of his troops. In the final days of the war Appo accompanied Anakin Skywalker to Coruscant’s Jedi Temple as part of Order 66. When Senator Bail Organa arrived during the aftermath of the Temple attack, Appo told him of the “Jedi rebellion” and ordered him to leave the area.",
        "databank_url": "http://starwars.wikia.com/wiki/Appo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/ask-aak_cd1a237e.jpeg?region=192%2C0%2C1170%2C878",
        "name": "Ask Aak",
        "slug": "ask-aak",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "Ask Aak was the Gran senator representing Malastare during the crisis that led to the Clone Wars. As a member of Chancellor Palpatine’s inner-circle, he was privy to many of the meetings and decisions that allowed the Republic to take military action against the secessionists threatening to leave the Republic. He was a strong proponent of this action, but allowed Representative Binks to advance the military creation act.",
        "databank_url": "http://starwars.wikia.com/wiki/Ask_Aak"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_aurrasing_01_169_dce3aa30.jpeg?region=263%2C0%2C1170%2C878",
        "name": "Aurra Sing",
        "slug": "aurra-sing",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "A feared bounty hunter known for her chalk-white skin and built-in comlink antenna, Aurra Sing was an expert sniper and trained assassin who would work for anyone who paid her. After the death of Jango Fett, Aurra trained Boba Fett as a bounty hunter, teaching him the skills -- and the ruthlessness -- that he would need in pursuing his deadly profession.",
        "databank_url": "http://starwars.wikia.com/wiki/Aurra_Sing"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/b-u4d_73f93ac6.jpeg?region=0%2C0%2C1387%2C1040",
        "name": "B-U4D (Buford)",
        "slug": "b-u4d-buford",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A burly loading droid clad in yellow ceramic armor plate, B-U4D serves on D’Qar as part of the ground crew that keeps the Resistance’s starfighters ready to fly. Tough and hard-working, “Buford” is one of many Resistance droids granted independence and seen as partners in the cause rather than mere machines.",
        "databank_url": "http://starwars.wikia.com/wiki/B-U4D_(Buford)"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Bail_Organa_e28bc2fc.jpeg?region=387%2C0%2C1171%2C878",
        "name": "Bail Organa",
        "slug": "bail-organa",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars Rebels",
            "Star Wars: The Clone Wars"
        ],
        "description": "Bail Organa, a member of Alderaan's royal family and the planet's representative to the Republic Senate, earned respect on Coruscant for his honesty and his commitment to justice. Prior to the Clone Wars, Bail served alongside Senator Padmé  Amidala as a member of Chancellor Palpatine's Loyalist Committee. The two became close friends, and recruited like-minded allies to prevent Palpatine's alarming grabs for power. At the end of the war, Bail Organa adopted Padmé's daughter Leia and raised her as an Alderaanian princess. While representing Alderaan in the Imperial Senate, he worked secretly with allies such as Mon Mothma and Ahsoka Tano to assist rebel cells scattered across the galaxy, working towards the day that a unified Rebellion could emerge. Bail died when the Death Star destroyed his homeworld.",
        "databank_url": "http://starwars.wikia.com/wiki/Bail_Organa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/bala-tik_7d2b0e4c.jpeg?region=312%2C219%2C872%2C653",
        "name": "Bala-Tik",
        "slug": "bala-tik",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "An agent of the feared Guavian Death Gang, Bala-Tik’s black leather coat and percussive cannon indicate his status within the galactic underworld. Bala-Tik negotiates business for the Guavians, backed by faceless, voiceless cybernetic soldiers awaiting the signal to take action. Bala-Tik considers Han Solo a capable smuggler and a valuable source of information, but his patience with the slippery Corellian and his endless excuses has all but run out.",
        "databank_url": "http://starwars.wikia.com/wiki/Bala-Tik"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/barada_cd0c628e.jpeg?region=337%2C0%2C885%2C664",
        "name": "Barada",
        "slug": "barada",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "Barada was a Klatoonian slave who served as muscle and a mechanic for Jabba the Hutt on Tatooine. As the man in charge of maintenance for all of Jabba’s repulsor-operated vehicles, he was sent to the Great Pit of Carkoon when Jabba tried executing Luke Skywalker and the rest of the Rebels working to free Han Solo from his debt. He was present on one of the skiffs escorting Jabba and his retinue to watch the execution, but when Skywalker set his plan into motion, Barada was cut down by the Jedi’s green-bladed lightsaber.",
        "databank_url": "http://starwars.wikia.com/wiki/Barada"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Barriss-Offee-main-image_a4f0cc76.jpeg?region=253%2C0%2C1094%2C821",
        "name": "Barriss Offee",
        "slug": "barriss-offee",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "The Mirialan Padawan to Luminara Unduli, Barriss Offee preferred learning and studying ancient Jedi texts in the Temple to war. This mindset, while noble, led her down a dark path that saw her betray friends and commit terrible acts.",
        "databank_url": "http://starwars.wikia.com/wiki/Barriss_Offee"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/bb-8_14e2ad77.jpeg?region=390%2C0%2C1170%2C878",
        "name": "BB-8",
        "slug": "bb-8",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A skittish but loyal astromech, BB-8 accompanied Poe Dameron on many missions for the Resistance, helping keep his X-wing in working order. When Poe’s mission to Jakku ended with his capture by the First Order, BB-8 fled into the desert with a vital clue to the location of Jedi Master Luke Skywalker.",
        "databank_url": "http://starwars.wikia.com/wiki/BB-8"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_benquadinaros_01_169_0c77b6a0.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Ben Quadinaros",
        "slug": "ben-quadinaros",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "The pudgy, comic-faced Ben Quadinaros was a rookie Podracer who claimed he came from the mysterious Tund system. He competed in the Boonta Eve Podrace that saw the liberation of Anakin Skywalker from slavery. Ben was largely inexperienced, and was quite terrified of the Boonta race. At the start of the race, his engines wouldn't even ignite. It was not until most of his competitors were already heading towards their second lap that his four engines did light -- just as his power couplings shorted, sending the rockets flying about the arena.",
        "databank_url": "http://starwars.wikia.com/wiki/Ben_Quadinaros"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_berulars_01_169_68101518.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Beru Lars",
        "slug": "beru-lars",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "As a young, shy girl, Beru Whitesun's aspirations did not reach beyond Tatooine. She was content to marry Owen Lars and lead the tough life of a moisture farmer. Beru also fulfilled the role of guardian and substitute mother to young Luke Skywalker, and repeatedly voiced her support for his dream of joining his friends at the Academy. Beru fell victim to the Empire when Imperial stormtroopers raided the family farm in search of droids thought to have top-secret plans for the Empire's ultimate weapon, the Death Star.",
        "databank_url": "http://starwars.wikia.com/wiki/Beru_Lars"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_bibfortuna_01_169_01aef5b7.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Bib Fortuna",
        "slug": "bib-fortuna",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Those attempting to do business with Jabba the Hutt first needed to maneuver past his pasty-faced majordomo, the Twi'lek Bib Fortuna. The darkly robed attendant often hovered near Jabba's ear, offering advice and feeding information. Fortuna followed the rules of protocol in the Hutt's court (such as they were), and spoke only in Huttese, though he understood other tongues. Fortuna's affiliation with Jabba stretched over decades.",
        "databank_url": "http://starwars.wikia.com/wiki/Bib_Fortuna"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/image_606ff7f7.jpeg?region=352%2C0%2C1170%2C878",
        "name": "Biggs Darklighter",
        "slug": "biggs-darklighter",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "Biggs Darklighter grew up on Tatooine with Luke Skywalker, and shared his friend's dreams of escaping the dull desert world. After graduating from the Imperial Academy, he defected from the Empire's service to join the Rebellion. He and Luke were reunited at Yavin 4's Rebel base, and flew together against the Death Star. Luke returned from that mission as a hero, but Biggs did not survive.",
        "databank_url": "http://starwars.wikia.com/wiki/Biggs_Darklighter"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Boba-Fett_61fdadfd.jpeg?region=181%2C0%2C900%2C675",
        "name": "Boba Fett",
        "slug": "boba-fett",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "With his customized Mandalorian armor, deadly weaponry, and silent demeanor, Boba Fett was one of the most feared bounty hunters in the galaxy. A genetic clone of his “father,” bounty hunter Jango Fett, Boba learned combat and martial skills from a young age. Over the course of his career, which included contracts for the Empire and the criminal underworld, he became a legend.",
        "databank_url": "http://starwars.wikia.com/wiki/Boba_Fett"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/boshek-main-image_f7900f5e.jpeg?region=498%2C0%2C883%2C661",
        "name": "BoShek",
        "slug": "boshek",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "A Corellian smuggler and pilot-for-hire, BoShek was cooling his heels at the bar in Tatooine’s Mos Eisley cantina when Obi-Wan Kenobi introduced himself and said he was looking to hire a charter without attracting Imperial attention. BoShek didn’t take the job, but he knew two pilots who might be interested, and introduced Kenobi to Chewbacca the Wookiee.",
        "databank_url": "http://starwars.wikia.com/wiki/BoShek"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_bossnass_01_169_ef11c0db.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Boss Nass",
        "slug": "boss-nass",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "The stout and stern leader of the Gungans, Boss Nass was a proud keeper of his people's ways. His booming voice issued decrees on behalf of all the Gungans of Otoh Gunga. He kept a tight rein on Gungan affairs, continuing a longstanding custom of isolationism. Though Nass' temper is short, displays of courage and humility can pierce through his preconceptions. When Queen Amidala prostrated herself before the Gungan leader to request his aid in fighting off the Trade Federation invasion, he was impressed. Nass committed the Gungan Grand Army to wage war against invading battle droids.",
        "databank_url": "http://starwars.wikia.com/wiki/Boss_Nass"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_bossk_01_169_c3c42fbe.jpeg?region=390%2C0%2C1170%2C878",
        "name": "Bossk",
        "slug": "bossk",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: The Clone Wars"
        ],
        "description": "One of the most feared bounty hunters of the galaxy, Bossk used his natural Trandoshan hunting instincts to capture his prey. During the Clone Wars, the red-eyed reptilian partnered with Aurra Sing, Castas and young Boba Fett. Bossk didn't care much for vendettas or politics. He was in it to get paid. After a brief stint in a Republic prison, Bossk continued his partnership with Fett, becoming a bodyguard to the teen bounty hunter.  Decades later, Bossk answered Darth Vader's call to capture the Millennium Falcon after the Battle of Hoth, an assignment that put him in direct competition with Boba.",
        "databank_url": "http://starwars.wikia.com/wiki/Bossk"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Bultar-swan_7e78a9bc.jpeg?region=0%2C0%2C1152%2C864",
        "name": "Bultar Swan",
        "slug": "bultar-swan",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "The Jedi Knight Bultar Swan was one of the members of the Order selected to join a hastily assembled rescue party. Their target: Geonosis, where Anakin Skywalker and Obi-Wan Kenobi had fallen into Separatist hands.",
        "databank_url": "http://starwars.wikia.com/wiki/Bultar_Swan"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/C-3PO-See-Threepio_68fe125c.jpeg?region=255%2C0%2C1055%2C793",
        "name": "C-3PO (See-Threepio)",
        "slug": "c-3po",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: Episode VII The Force Awakens",
            "Star Wars Rebels",
            "Star Wars: The Clone Wars"
        ],
        "description": "C-3PO is a droid programmed for etiquette and protocol, built by the heroic Jedi Anakin Skywalker, and a constant companion to astromech R2-D2. Over the years, he was involved in some of the galaxy’s most defining moments and thrilling battles -- and is fluent in more than seven million forms of communication.",
        "databank_url": "http://starwars.wikia.com/wiki/C-3PO_(See-Threepio)"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_captainantilles_01_169_75e05265.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Captain Antilles",
        "slug": "captain-antilles",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "A level-headed ship officer schooled in diplomacy, and a capable pilot entrusted to ferry about the royal family of Alderaan, Captain Antilles served in Bail Organa's command staff. He was part of the bridge crew of Organa's diplomatic cruiser, a role he would continue during the time Princess Leia served as Senator of Alderaan.",
        "databank_url": "http://starwars.wikia.com/wiki/Captain_Antilles"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/captain-merumeru_87bf7c7d.jpeg?region=337%2C0%2C885%2C664",
        "name": "Captain Merumeru",
        "slug": "captain-merumeru",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Captain Merumeru was a Wookiee chieftain that led a group of Wookiee warriors into battle against the Separatists on Kashyyyk. Leading the charge with a roar, he fought valiantly on the beaches at the battle of Kachirho City alongside his Wookiees and Clone Soldiers of the Republic in the hours leading up to Order 66.",
        "databank_url": "http://starwars.wikia.com/wiki/Captain_Merumeru"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/needa_a045a7cd.jpeg?region=80%2C0%2C1089%2C817",
        "name": "Captain Needa",
        "slug": "captain-needa",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "Captain Needa commanded the Avenger, one of the Imperial Star Destroyers that fought for the Empire at the Battle of Hoth. His ship pursued the fleeing Millennium Falcon, but the freighter escaped under mysterious circumstances. Baffled but contrite, Needa decided it was his duty to apologize to Darth Vader for losing the ship.",
        "databank_url": "http://starwars.wikia.com/wiki/Captain_Needa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_captainpanaka_01_169_6a3ccac5.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Captain Panaka",
        "slug": "captain-panaka",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Queen Amidala's loyal protector during the Trade Federation invasion crisis was Captain Panaka. Panaka was often referred to as \"the quickest eyes on Naboo\" for his attention to detail and selfless dedication to the safety of the Queen.    Panaka commanded a team of Royal Palace Guards and Security Troopers stationed throughout Theed. During the Trade Federation invasion, Panaka stayed close to the Queen, ensuring her protection from the Neimoidians' plans. His loyalty was such that he would openly question the strategy of Jedi Knights if he thought it would somehow endanger Amidala.",
        "databank_url": "http://starwars.wikia.com/wiki/Captain_Panaka"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/captain-phasma_8f4ea1d7.jpeg?region=0%2C0%2C1387%2C1040",
        "name": "Captain Phasma",
        "slug": "captain-phasma",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Clad in distinctive armor of salvaged chromium, Captain Phasma commands the First Order’s legions of stormtroopers. A tough veteran commander, she has no use for fancy titles or complex war rooms, preferring to lead her troops in battle against the First Order’s enemies.",
        "databank_url": "http://starwars.wikia.com/wiki/Captain_Phasma"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/captain-typho_f9e8d7bd.jpeg?region=138%2C0%2C888%2C668",
        "name": "Captain Typho",
        "slug": "captain-typho",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Gregar Typho succeeded Captain Panaka as head of Padmé Amidala’s security detail, protecting her as Naboo’s queen and then as its Senator. During the Separatist Crisis, Typho endorsed the plan for Padmé to evade assassins by secretly returning to Naboo with Anakin Skywalker. He loyally defended the Senator against a host of enemies in the Clone Wars.",
        "databank_url": "http://starwars.wikia.com/wiki/Captain_Typho"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_chairmanpapanoida_01_169_aa41311a.jpeg?region=307%2C0%2C1169%2C878",
        "name": "Chairman Papanoida",
        "slug": "chairman-papanoida",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Papanoida became chairman of Pantora after the death of Chi Cho. When he refused to join the Separatists, they blockaded Pantora and hired the bounty hunter Greedo to kidnap Papanoida's daughters.    Unwilling to wait for Coruscant law enforcement or the Senate to help, Papanoida took it on himself to solve the kidnapping and rescue his children.",
        "databank_url": "http://starwars.wikia.com/wiki/Chairman_Papanoida"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/chewie-db_2c0efea2.jpeg?region=252%2C144%2C1078%2C810",
        "name": "Chewbacca",
        "slug": "chewbacca",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: Episode VII The Force Awakens",
            "Star Wars: The Clone Wars"
        ],
        "description": "A legendary Wookiee warrior and Han Solo’s co-pilot aboard the Millennium Falcon, Chewbacca was part of a core group of Rebels who restored freedom to the galaxy. Known for his short temper and accuracy with a bowcaster, Chewie also has a big heart -- and is unwavering in his loyalty to his friends. He has stuck with Han through years of turmoil that have changed both the galaxy and their lives.",
        "databank_url": "http://starwars.wikia.com/wiki/Chewbacca"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/chi-eekway-papanoida-main-image_e04d488e.jpeg?region=185%2C0%2C1375%2C1031",
        "name": "Chi Eekway Papanoida",
        "slug": "chi-eekway-papanoida",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "The daughter of Pantora's Chairman Papanoida, Chi Eekway became a pawn in a high-stakes political game when bounty hunters hired by the Trade Federation kidnapped her and her sister. Ahsoka Tano and Riyo Chuchi freed Chi from captivity aboard a Trade Federation vessel.",
        "databank_url": "http://starwars.wikia.com/wiki/Chi_Eekway_Papanoida"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/chief-chirpa_1176b0ea.jpeg?region=0%2C80%2C800%2C601",
        "name": "Chief Chirpa",
        "slug": "chief-chirpa",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "The chief of the Ewoks dwelling in Endor's Ewok village, Chief Chirpa agreed to join the struggle against the Empire, organizing war bands to fight the stormtroopers. As a sign of this commitment, he ordered that Luke Skywalker and his friends be adopted into his tribe.",
        "databank_url": "http://starwars.wikia.com/wiki/Chief_Chirpa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_cindrallig_01_169_a0fb1ef6.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Cin Drallig",
        "slug": "cin-drallig",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "An esteemed Jedi  Master and a swordsman of great skill, Cin Drallig was the head of security for the Jedi Temple on Coruscant. He is in command of the Temple Guard assignments, and also serves as a lightsaber instructor, as all veteran Jedi are encouraged to pass on what they have learned to a new generation of Padawan learners. Though it smacks of disrespect, Drallig has earned the unflattering nickname of \"the Troll\" among the Order.",
        "databank_url": "http://starwars.wikia.com/wiki/Cin_Drallig"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/clegg-holdfast_1633585d.jpeg?region=574%2C0%2C889%2C668",
        "name": "Clegg Holdfast",
        "slug": "clegg-holdfast",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "An arrogant journalist for Podracing Quarterly, Clegg Holdfast considered himself an expert racer and loved showing off his chestful of medals. His fancy decorations did Holdfast no good during the Boonta Eve Classic: On the race’s second lap, Sebulba’s illegal flame-jets cooked Holdfast’s engines, causing him to crash into the desert.",
        "databank_url": "http://starwars.wikia.com/wiki/Clegg_Holdfast"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_cliegglars_01_169_c2f0b9cb.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Cliegg Lars",
        "slug": "cliegg-lars",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "Cliegg Lars was a modest, good-hearted moisture farmer who lived on the Lars homestead, not far from the township of Anchorhead. During a trip to the bustling spaceport of Mos Espa, Cliegg fell in love with Shmi Skywalker, a slave owned by Toydarian junk trader Watto.    Cliegg purchased Shmi's freedom and, soon after, made her his bride. They lived a quiet existence for years on the homestead, surviving against the harsh desert elements. With Owen, Cliegg's son from a previous union, and Owen's girlfriend Beru Whitesun, the Lars homestead was a tiny island of familial warmth amidst the endless desert wastes. Until tragedy struck...",
        "databank_url": "http://starwars.wikia.com/wiki/Cliegg_Lars"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_clonecommanderbacara_01_169_aa642060.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Clone Commander Bacara",
        "slug": "clone-commander-bacara",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Clone Commander Bacara (clone designation CC-1138) was the leader of the Galactic Marines, a unit of clone troopers famous for their distinctive armor and relentlessness in combat. Known for his aggressive tactics, Bacara led Republic forces against the Separatists during the Outer Rim Sieges, culminating in the assault on Mygeeto.",
        "databank_url": "http://starwars.wikia.com/wiki/Clone_Commander_Bacara"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_clonecommanderbly_01_169_7452adc7.jpeg?region=81%2C0%2C1170%2C878",
        "name": "Clone Commander Bly",
        "slug": "clone-commander-bly",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A veteran of many Clone Wars battles, Clone Commander Bly (clone designation CC-5052) served in the 327th Star Corps on such worlds as Quell, Maridun, and Felucia. Bly developed a close working relationship with Jedi General Aayla Secura, who was always reassured to know the dependable clone trooper had her back.",
        "databank_url": "http://starwars.wikia.com/wiki/Clone_Commander_Bly"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_clonecommandercody_01_169_f3aa1a91.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Clone Commander Cody",
        "slug": "clone-commander-cody",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A natural and practical leader in the clone army, Cody was a good fit for General Kenobi, to whom he was particularly loyal. Cody's keen ability to strategize, combined with his fierce combat style in the heat of battle, earned him the respect of the Jedi, and of his fellow clones as well. He often worked with Captain Rex, with whom he became friends. Cody enjoyed a close relationship with Kenobi, often sharing a tension-busting joke with him during intense moments on the battlefield. When Darth Sidious gave Order 66, however, Cody's loyalty to Kenobi was eclipsed by his clone indoctrination, and he ordered his troops to fire on the Jedi.",
        "databank_url": "http://starwars.wikia.com/wiki/Clone_Commander_Cody"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_clonecommandergree_01_169_ccbc3da4.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Clone Commander Gree",
        "slug": "clone-commander-gree",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Clone Commander Gree, designation 1004, led the Elite Corps of clone troopers during the Clone Wars. He saw deployments on such heated battlefronts as Kashyyyk. Gree himself wore camouflaged armor to better blend into jungle surroundings. Though a faithful commander who carried out the Jedi's orders, Gree was ultimately loyal to the Republic. When Chancellor Palpatine enacted Order 66, Gree understood it was a worst-case scenario contingency -- the Jedi had betrayed the Republic, and were therefore dangerous enemies of the state.",
        "databank_url": "http://starwars.wikia.com/wiki/Clone_Commander_Gree"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_clonecommanderneyo_01_169_c4721166.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Clone Commander Neyo",
        "slug": "clone-commander-neyo",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Clone Commander Neyo was stationed on Saleucami during the Outer Rim Sieges. While on speeder bike patrol with his Jedi general, Stass Allie, he received Order 66 directly from Supreme Chancellor Palpatine. The command identified Allie as an enemy of the Republic. Carrying out the order, he stopped his BARC speeder bike, falling in behind the Jedi. He and a wingman opened fire with their speeder-mounted laser cannons, killing Stass Allie and destroying her speeder bike.",
        "databank_url": "http://starwars.wikia.com/wiki/Clone_Commander_Neyo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_clonecommanderponds_01_169_f0cc9515.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Clone Commander Ponds",
        "slug": "clone-commander-ponds",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "CT-411, known as Clone Commander Ponds, served under Jedi Master Mace Windu during the Clone Wars. A veteran of such battlefields as Geonosis, Ryloth, and Malastare, Ponds had an Aurebesh phrase stenciled on the back of his helmet that read, \"some guys have all the luck.\" Unfortunately, Ponds' luck ran out when his flagship, Endurance, was critically damaged by a saboteur and he was taken captive by merciless bounty hunters on Vanqor.",
        "databank_url": "http://starwars.wikia.com/wiki/Clone_Commander_Ponds"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/oddball_9e5f9aa6.jpeg?region=458%2C0%2C888%2C666",
        "name": "Clone Pilot Odd Ball",
        "slug": "clone-pilot-odd-ball",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A capable clone pilot with experience flying multiple starfighters and attack craft, Odd Ball fought at Teth, Umbara and Coruscant, sometimes flying alongside Obi-Wan Kenobi. He joined the hunt for the escaped Padawan Ahsoka Tano on Coruscant, and was engaged in battle above Utapau when Supreme Chancellor Palpatine issued Order 66, directing all clone forces to turn their weapons on their Jedi Generals.",
        "databank_url": "http://starwars.wikia.com/wiki/Clone_Pilot_Odd_Ball"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Coleman-trebor_6ac2cde4.jpeg?region=26%2C0%2C3484%2C2613",
        "name": "Coleman Trebor",
        "slug": "coleman-trebor",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "The towering Vurk Coleman Trebor served the Jedi faithfully, winning an appointment to the Jedi Council. At the Battle of Geonosis he came within seconds of ending the Clone Wars at the very beginning, only to fall to a bounty hunter's blaster.",
        "databank_url": "http://starwars.wikia.com/wiki/Coleman_Trebor"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/constable-zuvio_2814b373.jpeg?region=0%2C0%2C1560%2C1167",
        "name": "Constable Zuvio",
        "slug": "constable-zuvio",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "What’s an honorable Kyuzo like Constable Zuvio doing on a lawless planet like Jakku? The tough, taciturn Zuvio is the leader of Niima Outpost’s small militia, and keeps a wary yellow eye out for cheats, thieves and others bent on trouble. He is often found guarding Niima’s landing field, glowering at any local who strays too close to a visitor’s starship.",
        "databank_url": "http://starwars.wikia.com/wiki/Constable_Zuvio"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Count-Dooku_4f552149.jpeg?region=115%2C0%2C1076%2C808",
        "name": "Count Dooku",
        "slug": "count-dooku",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Count Dooku was a menacing Sith Lord and central figure in the Clone Wars. Once a Jedi -- trained by Yoda -- he became disillusioned with the Jedi Order and thirsted for greater power. Dooku voluntarily left the light side behind and became Darth Sidious’ dark side disciple, taking the secret name Darth Tyranus and leading the Separatist army. Dooku advanced Sidious’s secret plot to take over the galaxy, but forgot that betrayal is the nature of the Sith.",
        "databank_url": "http://starwars.wikia.com/wiki/Count_Dooku"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/e5d_ia_1559_acf49910.jpeg?region=647%2C0%2C1087%2C815",
        "name": "Dak Ralter",
        "slug": "dak-ralter",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "An eager young rebel pilot assigned to Hoth’s Echo Base, Dak dreamed of winning glorious victories in the struggle against the Empire. He served as Luke Skywalker’s tailgunner during the Battle of Hoth, but things didn’t go the way Dak had imagined them: He struggled with a malfunction in fire control, and then was killed by Imperial fire that struck the back of the snowspeeder.",
        "databank_url": "http://starwars.wikia.com/wiki/Dak_Ralter"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Darth-Maul_632eb5af.jpeg?region=297%2C39%2C1147%2C861",
        "name": "Darth Maul",
        "slug": "darth-maul",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "A deadly, agile Sith Lord trained by the evil Darth Sidious, Darth Maul was a formidable warrior and scheming mastermind. He wielded an intimidating double-bladed lightsaber and fought with a menacing ferocity. Though he fell in battle against Obi-Wan Kenobi, the Zabrak from Dathomir would prove to be much harder to destroy than originally believed.",
        "databank_url": "http://starwars.wikia.com/wiki/Darth_Maul"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Darth-Vader_6bda9114.jpeg?region=81%2C0%2C1237%2C928",
        "name": "Darth Vader",
        "slug": "darth-vader",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars Rebels"
        ],
        "description": "Once a heroic Jedi Knight, Darth Vader was seduced by the dark side of the Force, became a Sith Lord, and led the Empire’s eradication of the Jedi Order. He remained in service of the Emperor -- the evil Darth Sidious -- for decades, enforcing his Master’s will and seeking to crush the fledgling Rebel Alliance. But there was still good in him…",
        "databank_url": "http://starwars.wikia.com/wiki/Darth_Vader"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_daultaydofine_01_169_c94b9f38.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Daultay Dofine",
        "slug": "daultay-dofine",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "The unctuous captain of the Neimoidian blockade over Naboo, Dofine was an officer in the Trade Federation. Greedy, deceitful and cowardly, Dofine nevertheless had the wherewithal to openly question Darth Sidious' machinations, for which he was verbally reprimanded by the Sith Lord. Despite his insubordination, Dofine remained in command of the blockade's forces. He gave the order to activate the droids on the surface of Naboo. Dofine perished aboard the Droid Control Ship when Naboo starfighter forces destroyed the vessel.",
        "databank_url": "http://starwars.wikia.com/wiki/Daultay_Dofine"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_dengar_01_169_18886b62.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Dengar",
        "slug": "dengar",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: The Clone Wars"
        ],
        "description": "Crude and slovenly, Dengar was nonetheless an effective bounty hunter. While some hunters prided themselves on finesse and style, Dengar preferred firepower and destruction. Despite his scruffy-looking and battered exterior, Dengar thought highly of himself, enough to make blunt passes at shapely females that caught his eye. Despite these obnoxious qualities, Boba Fett enjoyed working with Dengar and held him in high regard due to his proven track record in hunting down prey.",
        "databank_url": "http://starwars.wikia.com/wiki/Dengar"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/image_220cf6a1.jpeg?region=495%2C0%2C1266%2C950",
        "name": "Depa Billaba",
        "slug": "depa-billaba",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "A Chalactan Jedi, Depa Billaba served on the Jedi Council in the final years of the Republic. She witnessed the discovery of Anakin Skywalker, whom Qui-Gon Jinn believed to be the Chosen One, and tried to determine the will of the Force as the galaxy slid into tumult and war. During the Clone Wars Billaba would would take Caleb Dume on as her Padawan, but was unable to finish his training before the dreaded Order 66. Forced into hiding, Caleb took the name \"Kanan Jarrus.\"",
        "databank_url": "http://starwars.wikia.com/wiki/Depa_Billaba"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/dex-tiree_3efe56ad.jpeg?region=338%2C0%2C884%2C663",
        "name": "Dex Tiree",
        "slug": "dex-tiree",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "Dex Tiree was a human pilot from Onderon who fought with distinction at the Battle of Yavin under the designation “Gold Two.” He was Jon “Dutch” Vander’s wingman, piloting a Y-Wing with the rest of Gold Squadron in the assault on the Death Star. Sadly, he was the first pilot hit when the Dark Lord of the Sith Darth Vader arrived in his TIE Advanced.",
        "databank_url": "http://starwars.wikia.com/wiki/Dex_Tiree"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_dexterjettster_01_169_09c89b71.jpeg?region=165%2C0%2C1170%2C878",
        "name": "Dexter Jettster",
        "slug": "dexter-jettster",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "Obi-Wan Kenobi counted on Dexter Jettster, an old friend, to identify a poison dart, and Jettster didn't fail him. The cook correctly recognized the small-tined projectile as a Kamino saberdart. Few have ever heard of the planet Kamino, but Dex not only informed Obi-Wan as to its location (12 parsecs south of the Rishi Maze), but also its inhabitants. Dex warned that the native Kaminoans -- cloners of some repute -- keep to themselves, but are welcoming to those with the credits to spare.",
        "databank_url": "http://starwars.wikia.com/wiki/Dexter_Jettster"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/dr-evazan-main-image_bf435393.jpeg?region=0%2C124%2C1239%2C931",
        "name": "Doctor Cornelius Evazan",
        "slug": "doctor-cornelius-evazan",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "A grubby, scarred smuggler from Alsakan, Cornelius Evazan was once a promising surgeon, but became notorious for conducting cruel medical experiments. Dr. Evazan tried to bully Luke Skywalker in the Mos Eisley cantina, boasting that he faced a death sentence in 12 systems. The doctor and his pal Ponda Baba assumed the young farmboy would be an easy target, and paid little heed to the old man in dusty robes who’d accompanied young Luke into the bar. That was a fatal mistake: when Evazan hurled Luke aside and pulled his blaster, Obi-Wan Kenobi coolly ignited his lightsaber and cut Evazan down.",
        "databank_url": "http://starwars.wikia.com/wiki/Doctor_Cornelius_Evazan"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/image_3bfc14aa.jpeg?region=364%2C0%2C2217%2C1662",
        "name": "Droopy McCool",
        "slug": "droopy-mccool",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "Droopy McCool played the chindinkalu flute in the Max Rebo Band, an ensemble that performed as Jabba's palace band on Tatooine. A veteran musician, Droopy was used to seedy dives and gigs for unsavory clients. But the depravity he saw in Jabba's court shocked even him.",
        "databank_url": "http://starwars.wikia.com/wiki/Droopy_McCool"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Eeth-Koth2_246ea172.jpeg?region=331%2C0%2C758%2C568",
        "name": "Eeth Koth",
        "slug": "eeth-koth",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "Eeth Koth was a member of the Jedi High Council in the final years of the order. From within the polished towers of the Jedi Temple on Coruscant, the Council governed the actions of the Jedi Knights. Koth was one of the 12 Jedi present when Qui-Gon Jinn presented Anakin Skywalker as the Chosen One to the Council. A determined warrior with a deep, spiritual connection to the Force, Koth resisted torture at the hands of General Grievous during the Clone Wars, and was even able to secretly communicate his location to the Jedi Council. Koth was saved from Separatist clutches by the daring efforts of his fellow Jedi.",
        "databank_url": "http://starwars.wikia.com/wiki/Eeth_Koth"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/elan-sleazebaggano-main-image_9ca2f407.jpeg?region=141%2C0%2C1347%2C1012",
        "name": "Elan Sleazebaggano",
        "slug": "elan-sleazebaggano",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "The aptly named Elan Sleazebaggano made his living selling death sticks to patrons of the Outlander Club and other hot spots in the underlevels of Coruscant. Always in search of credits, Sleazebaggano targeted both desperate addicts and unwise thrill-seekers.",
        "databank_url": "http://starwars.wikia.com/wiki/Elan_Sleazebaggano"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/4x3-databank-resistance_33fcf77d.jpeg?region=0%2C0%2C1408%2C1056",
        "name": "Ello Asty",
        "slug": "ello-asty",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "The Abednedo pilot Ello Asty is known among his fellow Resistance pilots for his superb abilities behind the stick – and for his trouble remembering that a squadron must act as a team, not a loose collection of individuals. Ello flew with Cobalt Squadron in the early days of the Resistance and is a member of Blue Squadron during the attack on Starkiller Base.",
        "databank_url": "http://starwars.wikia.com/wiki/Ello_Asty"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_emirwattambor_01_169_9528ba0f.jpeg?region=376%2C0%2C1089%2C818",
        "name": "Emir Wat Tambor",
        "slug": "emir-wat-tambor",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "The foreman of the Techno Union, Wat Tambor was one of the original and most fervent Separatist leaders, pledging his loyalty and his battle droid armies to Count Dooku at a pivotal meeting on Geonosis. Later in the war, Tambor was appointed emir of Ryloth. His occupation was a cruel one, in which Tambor stripped the Twi'leks of whatever valuables he could find, then bombed their villages.",
        "databank_url": "http://starwars.wikia.com/wiki/Emir_Wat_Tambor"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Emperor-Palpatine_7ac4a10e.jpeg?region=142%2C0%2C1200%2C900",
        "name": "Emperor Palpatine / Darth Sidious",
        "slug": "emperor-palpatine-darth-sidious",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars",
            "Star Wars Rebels"
        ],
        "description": "Scheming, powerful, and evil to the core, Darth Sidious restored the Sith and destroyed the Jedi Order. Living a double life, Sidious was in fact Palpatine, a Naboo Senator and phantom menace. He slowly manipulated the political system of the Galactic Republic until he was named Supreme Chancellor -- and eventually Emperor -- ruling the galaxy through fear and tyranny.",
        "databank_url": "http://starwars.wikia.com/wiki/Emperor_Palpatine_/_Darth_Sidious"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/ev-9d9-2_28db778f.jpeg?region=0%2C0%2C1560%2C1170",
        "name": "EV-9D9",
        "slug": "ev-9d9",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "The supervisor of Jabba the Hutt's droid pool, EV-9D9 was a gangly mechanical with a quirk in her programming that made her enjoy tormenting and dismembering other droids. She turned a dank work area in the depths of Jabba's palace into a grim torture chamber.",
        "databank_url": "http://starwars.wikia.com/wiki/EV-9D9"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_evenpiell_01_169_f1528605.jpeg?region=87%2C0%2C1170%2C878",
        "name": "Even Piell",
        "slug": "even-piell",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "A gruff and battle-hardened Jedi as well as senior member of the Jedi council, Even Piell was bigger than life though he was small in stature. Highly skilled with a lightsaber and a great warrior, Piell was always willing to charge into battle. During the Clone Wars, he was tasked with some of the most crucial missions, protecting vital Republic territory and information.",
        "databank_url": "http://starwars.wikia.com/wiki/Even_Piell"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/figrin-dan_59ce7b09.jpeg?region=45%2C0%2C1067%2C802",
        "name": "Figrin D’an",
        "slug": "figrin-d-an",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "Figrin D’an was the rocking frontman for the all-Bith band “The Modal Nodes.” His deft playing of the Kloo Horn for the band earned him the nickname “Fiery” Figrin. Playing their most recognizable tune in the Mos Eisley cantina, they were interrupted briefly when Obi-Wan Kenobi attacked Ponda Boba and Dr. Cornelius Evazan.",
        "databank_url": "http://starwars.wikia.com/wiki/Figrin_D’an"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/finn_450f054b.jpeg?region=263%2C0%2C1170%2C878",
        "name": "Finn",
        "slug": "finn",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "FN-2187 was trained since birth to serve the First Order as a stormtrooper, but a skirmish on Jakku awakened his conscience and drove him down a different path, one that proved both heroic and dangerous. He helped Poe Dameron escape the First Order – picking up the nickname Finn in doing so – and then sought his own freedom alongside Rey and BB-8.",
        "databank_url": "http://starwars.wikia.com/wiki/Finn"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_fodeandbeed_01_169_823c43bd.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Fode and Beed",
        "slug": "fode-and-beed",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Flamboyant, colorful and not always too accurate, Fode and Beed were the popular announcers of the Boonta Eve Podrace. The two were well suited for their chosen vocation -- they were a two-headed alien that shared a single body. Fode, whose skin was tinted red, provided commentary in an easy Basic drawl, while Beed, the green-hued head, provided counterpoint in Huttese.",
        "databank_url": "http://starwars.wikia.com/wiki/Fode_and_Beed"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/gardulla-the-hutt-main-image_5f3900ca.jpeg?region=160%2C0%2C883%2C661",
        "name": "Gardulla the Hutt",
        "slug": "gardulla-the-hutt",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "A wily crime lord and member of the shadowy Hutt Council, Gardulla was the original owner of Shmi and Anakin Skywalker, but lost them betting with the junk dealer Watto. She watched her former slave’s victory in the Boonta Eve Classic alongside Jabba. Years later, Gardulla and the Council hired Cad Bane to free Ziro the Hutt from a Republic prison, fearing the traitorous Hutt would spill their secrets. When Ziro escaped from Gardulla’s palace on Nal Hutta, she hired Bane to track him down.",
        "databank_url": "http://starwars.wikia.com/wiki/Gardulla_the_Hutt"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/garindan-main-image_409cd281.jpeg?region=21%2C0%2C691%2C519",
        "name": "Garindan",
        "slug": "garindan",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "A long-snooted Kubaz, Garindan made a living ferreting out information in Mos Eisley and selling it to the highest bidder. After the Empire hired Garindan and other spies to search for a pair of missing droids, the Kubaz discovered a duo that fit the Imperial description. He followed Luke Skywalker and Obi-Wan Kenobi to Docking Bay 94 for their rendezvous with Han Solo, then summoned Imperial troops to apprehend them.",
        "databank_url": "http://starwars.wikia.com/wiki/Garindan"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/garven-dreis_efe9195b.jpeg?region=69%2C0%2C711%2C533",
        "name": "Garven Dreis",
        "slug": "garven-dreis",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "A native of the planet Virujansi, Garven “Dave” Dreis flew in the Battle of Yavin as Red Leader. After witnessing the death of his friend Pops Krail and the pilots of Gold Squadron at the hands of Darth Vader, Dreis began his own run at the Death Star’s thermal exhaust port, with Luke Skywalker keeping another group of Red Squadron pilots back in case the attempt failed. Dreis survived long enough to fire his proton torpedoes at the battle station’s exhaust port, but his shot impacted on the surface instead of entering the port. Vader then gunned Red Leader down.",
        "databank_url": "http://starwars.wikia.com/wiki/Garven_Dreis"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/gasgano_6f648f83.jpeg?region=218%2C0%2C1816%2C1362",
        "name": "Gasgano",
        "slug": "gasgano",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "A slight, spindly, six-limbed alien, Gasgano was a thrill-seeker uniquely suited to the extreme sport of Podracing. Gasgano was very competitive, and sought to beat racers Anakin Skywalker and Sebulba during the Boonta Eve Podrace. He piloted a green Ord Pedrovia Podracer in the competition.",
        "databank_url": "http://starwars.wikia.com/wiki/Gasgano"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_generaldodonna_01_169_d3a64fe4.jpeg?region=199%2C0%2C1171%2C878",
        "name": "General Dodonna",
        "slug": "general-dodonna",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "General Jan Dodonna served as the military leader of the Rebel base on Yavin 4. The veteran officer devised the daring plan to penetrate the Death Star's defenses with starfighters, and then directed the attack on the battle station's vulnerable thermal exhaust port.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Dodonna"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/General-Grievous_c9df9cb5.jpeg?region=219%2C0%2C900%2C675",
        "name": "General Grievous",
        "slug": "general-grievous",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "General Grievous was a brilliant Separatist military strategist and a feared Jedi hunter, known for his ruthlessness and hacking cough. His body itself was a weapon, allowing him lightning quick strikes and devastating blows. But he was also quick to run from a fight, a tactic that worked until one final meeting with Obi-Wan Kenobi.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Grievous"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/general-hux_078a3f89.jpeg?region=330%2C0%2C1073%2C805",
        "name": "General Hux",
        "slug": "general-hux",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A young, ruthless officer in the First Order, General Hux has complete confidence in his troops, training methods and weapons. A rival of Kylo Ren’s, Hux eagerly awaits the day when the First Order will bring down the hated New Republic, and considers it his destiny to rule the galaxy.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Hux"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_generalmadine_01_169_81edb078.jpeg?region=390%2C0%2C1170%2C878",
        "name": "General Madine",
        "slug": "general-madine",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "General Madine specialized in covert actions for the Rebel Alliance, waging war in secret against Imperial troops and the Emperor's own shadowy agents. His plans culminated with the operation to destroy the shield generator on the Forest Moon of Endor.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Madine"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/general-rieekan_bdcddf69.jpeg?region=86%2C0%2C714%2C536",
        "name": "General Rieekan",
        "slug": "general-rieekan",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "A battle-weary veteran of the Clone Wars, Carlist Rieekan served the Alliance in its struggle against the Empire, commanding rebel forces on Hoth. Rieekan was a native of Alderaan, and the destruction of his homeworld haunted him. After Han Solo and Chewbacca discovered an Imperial probe droid on Hoth, Rieekan ordered an immediate evacuation of Echo Base. The decision wasn’t popular – rebel personnel had barely completed the grueling work of establishing the base -- but Rieekan’s caution prevented the Battle of Hoth from being a total rout, and so helped save the Alliance.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Rieekan"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/general-tagge-main-image_d9443d72.jpeg?region=60%2C0%2C877%2C657",
        "name": "General Tagge",
        "slug": "general-tagge",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "Born into wealth and privilege on Tepasi, General Cassio Tagge served as chief of military operations aboard the first Death Star, though he disdained the battle station as “Tarkin’s Folly.” Unlike his rival Admiral Motti, Tagge took the threat posed by the Rebel Alliance seriously. Tagge was not aboard the Death Star when it exploded over Yavin; acknowledging that Tagge had been correct about the rebel threat, the Emperor promoted him to Grand General and placed him in charge of the Imperial military.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Tagge"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_generaltarpals_01_169_cb2134d2.jpeg?region=195%2C0%2C1171%2C878",
        "name": "General Tarpals",
        "slug": "general-tarpals",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "The gravelly-voiced patrol chief of Otoh Gunga, Tarpals has endured many a headache caused by the antics of Jar Jar Binks. Tarpals kept an eye on the bumbling outcast, making sure the youngster didn't re-enter Gungan society. During the Trade Federation occupation of Naboo, Tarpals was part of the Gungan Grand Army that fought against the battle droid invaders. Ironically, Tarpals served under Binks, who had unexpectedly received the rank of general by Boss Nass himself. Tarpals stayed close to Binks, trying to keep his commanding officer out of trouble.     By the time of the Clone Wars, Tarpals was promoted to general, and served as leader of the Gungan Grand Army.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Tarpals"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_generalveers_01_169_ed056bbf.jpeg?region=195%2C0%2C1171%2C878",
        "name": "General Veers",
        "slug": "general-veers",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "A cool and efficient officer, General Veers led the Imperial assault on Hoth, marching his AT-AT walkers across the planet's frozen plains and destroying the massive generators powering the Rebel base's protective energy shield.",
        "databank_url": "http://starwars.wikia.com/wiki/General_Veers"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/4x3-databank-resistance_33fcf77d.jpeg?region=0%2C0%2C1408%2C1056",
        "name": "Goss Toowers",
        "slug": "goss-toowers",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Goss Toowers, a member of the Shozer species, is one of the hard-working technicians who keep the Resistance base on D’Qar running. Toowers and his fellow ground crew members handle everything from monitoring the arrival and departure of ships to maintaining the Resistance’s X-wing squadrons – often the only line of defense for worlds targeted by the First Order.",
        "databank_url": "http://starwars.wikia.com/wiki/Goss_Toowers"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_tarkin_01_169_97d0a95c.jpeg?region=106%2C0%2C1170%2C878",
        "name": "Grand Moff Tarkin",
        "slug": "tarkin",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars Rebels",
            "Star Wars: The Clone Wars"
        ],
        "description": "An ambitious, ruthless proponent of military power, Wilhuff Tarkin became a favorite of Supreme Chancellor Palpatine and rose rapidly through the Imperial ranks. Shortly after the Empire's creation, he was put in charge of the construction of the Death Star. Tarkin saw the Death Star as a way to crush all dissent to the Empire's rule -- fear of the station's planet-killing superlaser would keep the galaxy's star systems in line. He demonstrated the station's power by destroying Alderaan, but died soon afterwards when the Death Star itself was destroyed.",
        "databank_url": "http://starwars.wikia.com/wiki/Grand_Moff_Tarkin"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/greeata_813f2567.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Greeata",
        "slug": "greeata",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Greeata joined the Max Rebo Band as a backup singer and dancer for some of the ensemble's gigs, including their performance at Jabba's palace. Her orange hair and ample jewelry ensured she got noticed even by listeners lacking musical taste.",
        "databank_url": "http://starwars.wikia.com/wiki/Greeata"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_greedo_01_169_3e4b96ef.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Greedo",
        "slug": "greedo",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: The Clone Wars"
        ],
        "description": "Greedo was a Rodian bounty hunter with a tapir-like snout, bulbous eyes, pea-green skin, and a crest of spines atop his skull. He was overzealous and a bit slow on the take, not to mention a pretty poor shot with a blaster. Though he fancied himself a big time bounty hunter in the employ of no less an underworld figure than Jabba the Hutt, in truth, no one took him too seriously.",
        "databank_url": "http://starwars.wikia.com/wiki/Greedo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Han-Solo_1d08eb2e.jpeg?region=326%2C0%2C1199%2C901",
        "name": "Han Solo",
        "slug": "han-solo",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Smuggler. Scoundrel. Hero. Han Solo, captain of the Millennium Falcon, was one of the great leaders of the Rebel Alliance. He and his co-pilot Chewbacca came to believe in the cause of galactic freedom, joining Luke Skywalker and Princess Leia Organa in the fight against the Empire. But after the Battle of Endor, Han would face difficult times in a galaxy plagued by chaos and uncertainty.",
        "databank_url": "http://starwars.wikia.com/wiki/Han_Solo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/hermie-odle-16-9_5bb4fd3a.jpeg?region=146%2C0%2C1170%2C878",
        "name": "Hermi Odle",
        "slug": "hermi-odle",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A burly thug with a shady past, Hermi Odle was one of Jabba the Hutt's resident gangsters on Tatooine. Wise members of the Hutt's court knew Odle was far more dangerous than his stooped posture, shuffling gait and drooping lip suggested.",
        "databank_url": "http://starwars.wikia.com/wiki/Hermi_Odle"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/hermione-bagwa-main-image_edc65dfa.jpeg?region=69%2C0%2C1359%2C1019",
        "name": "Hermione Bagwa",
        "slug": "hermione-bagwa",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "Hermione Bagwa was a waitress at Dex's Diner in the Coco Town section of Coruscant, serving a never-ending parade of clients that included speeder drivers, maintenance techs, ambassadors and Senate aides -- and sometimes even a Jedi Knight or two.",
        "databank_url": "http://starwars.wikia.com/wiki/Hermione_Bagwa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/ig_88_cdd5cc52.jpeg?region=0%2C0%2C2453%2C1849",
        "name": "IG-88",
        "slug": "ig-88",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "Many people in the galaxy fear droids, what with the memories of the Clone Wars still fresh in their minds. Far more terrifying than battle droids were assassin droids, independently programmed mechanical killers that had no masters. IG-88 is a battered chrome war droid who has become a bounty hunter, and answered Darth Vader's call to capture the Millennium Falcon during the events surrounding the Battle of Hoth.",
        "databank_url": "http://starwars.wikia.com/wiki/IG-88"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Jabba-The-Hutt_b5a08a70.jpeg?region=150%2C0%2C900%2C675",
        "name": "Jabba the Hutt",
        "slug": "jabba-the-hutt",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "Jabba the Hutt was one of the galaxy’s most powerful gangsters, with far-reaching influence in both politics and the criminal underworld. There were no second chances with Jabba, something Han Solo would find out -- though the slug-like alien would ultimately fall victim to his own hubris and vengeful ways.",
        "databank_url": "http://starwars.wikia.com/wiki/Jabba_the_Hutt"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_jangofett_01_169_884cefab.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Jango Fett",
        "slug": "jango-fett",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "In the final years of the Republic, Jango Fett was regarded as the best bounty hunter in the galaxy. A proficient marksman and unarmed combatant, Fett was covered in a sleek armored suit that concealed his scarred face. His combat gear featured an arsenal of weaponry, including retractable wrist blades, a snare, dual blaster pistols and other more exotic tools of the trade. In combat, Jango used his harnessed jetpack to gain the advantage of speed and height over his enemies. The backpack also carried a nasty surprise -- an explosive rocket could be launched from it. For interstellar travel, Jango traveled aboard his well-worn starship, Slave I.",
        "databank_url": "http://starwars.wikia.com/wiki/Jango_Fett"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/e6d_ia_2804_b69b3a63.jpeg?region=502%2C305%2C586%2C440",
        "name": "Janus Greejatus",
        "slug": "janus-greejatus",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "Greejatus was a gaunt human in flowing robes and garish hat who served as one of Emperor Palpatine’s closest advisors. He served in Imperial Ruling Council and accompanied the Emperor to the second Death Star as it hovered over the forest moon of Endor. With the destruction of the Death Star, one might assume Greejatus was killed, but his ultimate fate was unknown.",
        "databank_url": "http://starwars.wikia.com/wiki/Janus_Greejatus"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_jarjarbinks_01_169_c70767ab.jpeg?region=114%2C0%2C1170%2C878",
        "name": "Jar Jar Binks",
        "slug": "jar-jar-binks",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A clumsy, well-meaning Gungan outcast on Naboo, Jar Jar Binks struggled to prove his worth throughout his life. Putting his awkward past behind him, Jar Jar left the swamps of Naboo to enter the even murkier waters of Coruscant politics, becoming a representative for his people in the galactic capital. There, his best intentions and eagerness to serve were exploited by scheming Senators and others in positions of power.",
        "databank_url": "http://starwars.wikia.com/wiki/Jar_Jar_Binks"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/jek-porkins-main-image_0b8d2d13.jpeg?region=142%2C0%2C1138%2C852",
        "name": "Jek Porkins",
        "slug": "jek-porkins",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "Jek Porkins was a pilot and trader who abandoned his homeworld when the Empire moved in and developed a new military base there. The burly rebel pilot flew an X-wing at the Battle of Yavin under the call sign Red 6. His X-wing developed a mechanical problem early in the battle, leaving him struggling to maneuver. Before Porkins or his astromech could fix the problem, one of the Death Star’s turbolasers zeroed in on the X-wing, incinerating it and killing Porkins instantly.",
        "databank_url": "http://starwars.wikia.com/wiki/Jek_Porkins"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/jess-pava_a8f22925.jpeg?region=390%2C0%2C1170%2C878",
        "name": "Jess Pava",
        "slug": "jess-pava",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A brave young Resistance pilot, Jess, or \"Testor\" as she is also called, grew up idolizing the legendary pilots of previous generations, such as Luke Skywalker and Wedge Antilles. Jess gets her own chance at glory when the Resistance attacks Starkiller Base, flying alongside Poe Dameron and Snap Wexley under the call sign Blue Three.",
        "databank_url": "http://starwars.wikia.com/wiki/Jess_Pava"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_jira_01_169_2cc4a696.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Jira",
        "slug": "jira",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "A poor yet jolly woman, the elderly Jira ran a small food stand in the Mos Espa marketplace. Among her wares were tasty fruits called pallies. Young Anakin Skywalker befriended Jira, and searched for a cooling unit that the old woman needed. Jira proclaimed Anakin \"the kindest boy in the galaxy.\"",
        "databank_url": "http://starwars.wikia.com/wiki/Jira"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/jocasta-nu_a3b32f08.jpeg?region=294%2C0%2C1656%2C1242",
        "name": "Jocasta Nu",
        "slug": "jocasta-nu",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "The Jedi Archives are the galaxy's greatest repository of knowledge, and Madame Jocasta Nu is their Chief Librarian. She helps other Jedi find information in the Archive using its data terminals, and she controls access to the restricted contents of its Holocron Vault. Jocasta Nu can sometimes be too confident in thinking that the Archives contain the correct answers to all questions.",
        "databank_url": "http://starwars.wikia.com/wiki/Jocasta_Nu"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/image_1cbf7376.jpeg?region=210%2C0%2C2217%2C1662",
        "name": "Joh Yowza",
        "slug": "joh-yowza",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A shaggy Yuzzum with a big stage presence and an even bigger voice, Joh Yowza sometimes sang with the Max Rebo Band. Even the most jaded music fans found it hard to ignore the vocal fireworks of his duets with Sy Snootles.",
        "databank_url": "http://starwars.wikia.com/wiki/Joh_Yowza"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/jon-dutch-vander_ed24f84e.jpeg?region=0%2C6%2C683%2C513",
        "name": "Jon \"Dutch\" Vander",
        "slug": "jon-dutch-vander",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "Jon Vander, nicknamed “Dutch,” is a former Imperial pilot who defected when he was ordered to bomb rebel-friendly areas of his home planet. After joining the rebellion, Vander flew a Y-wing as Gold Leader during the Battle of Yavin. He questioned the rebel strategy of attacking the Death Star with fighters, but led the first attack on the battle station’s vulnerable thermal exhaust port. Unfortunately for Vander, Darth Vader and his wingmates pursued the Y-wings into the trench. Unable to maneuver, Vander was shot down, along with his fellow Y-wing pilots.",
        "databank_url": "http://starwars.wikia.com/wiki/Jon_\"Dutch\"_Vander"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_kiadimundi_01_169_0a8842d3.jpeg?region=122%2C0%2C1169%2C878",
        "name": "Ki-Adi-Mundi",
        "slug": "ki-adi-mundi",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Ki-Adi-Mundi was a Cerean alien who sat on the Jedi Council. A humanoid being, Ki's most distinguishing physical feature was an enlarged conical cranium that contained a binary brain. When Jedi Master Qui-Gon Jinn reported a Sith attack during the events surrounding the Battle of Naboo, Ki-Adi-Mundi expressed shock at the notion. \"Impossible,\" he remarked, \"the Sith have been extinct for a millennium.\" He also failed to see how far Count Dooku had fallen from the Jedi ideals just prior to the Clone Wars, believing that Dooku was incapable of violence or murder.",
        "databank_url": "http://starwars.wikia.com/wiki/Ki-Adi-Mundi"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_kitfisto_01_169_21517d01.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Kit Fisto",
        "slug": "kit-fisto",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Kit Fisto is a striking example of an alien Jedi, a Nautolan with large eyes, and a gathered tangle of flexible tentacle-tresses extending from his head. He is at home in the waters of aquatic planets, like his native Glee Anselm. As a Jedi Master, Fisto has an intense focus, particularly in combat. He is also much more laid back and capable of enjoying a hearty chuckle than some of his humorless colleagues.",
        "databank_url": "http://starwars.wikia.com/wiki/Kit_Fisto"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/kitster_1928585a.jpeg?region=25%2C37%2C1683%2C1263",
        "name": "Kitster",
        "slug": "kitster",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Kitster was one of Anakin Skywalker's friends before the young podracing champ left Tatooine for the life of a Jedi. An optimistic human boy about the same age as Anakin, Kitster was part of Anakin's pit team in the fateful Boonta Eve Classic race that saw young Skywalker win his freedom.",
        "databank_url": "http://starwars.wikia.com/wiki/Kitster"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/klaatu-main-image_8074b83b.jpeg?region=0%2C0%2C1386%2C1042",
        "name": "Klaatu",
        "slug": "klaatu",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A Kadas’sa’Nikto from Kintan, Klaatu was a henchman of Jabba the Hutt, and spent his time at the Hutt’s palace repairing skiffs, eagerly awaiting executions and amassing ever-larger gambling debts. Klaatu confronted Luke Skywalker during the battle at the Great Pit of Carkoon, but fled after Luke disarmed him with a stroke of his lightsaber. He died when Jabba’s sail barge exploded.",
        "databank_url": "http://starwars.wikia.com/wiki/Klaatu"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/kylo-ren_fa163069.jpeg?region=148%2C0%2C1325%2C995",
        "name": "Kylo Ren",
        "slug": "kylo-ren",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A dark warrior strong with the Force, Kylo Ren commands First Order missions with a temper as fiery as his unconventional lightsaber. As a leader of the First Order and a student of Supreme Leader Snoke, he seeks to destroy the New Republic, the Resistance and the legacy of the Jedi.",
        "databank_url": "http://starwars.wikia.com/wiki/Kylo_Ren"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/kaminoan-main-image_40db5ba5.jpeg?region=146%2C0%2C889%2C665",
        "name": "Lama Su",
        "slug": "lama-su",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "The lanky Prime Minister of remote Kamino, Lama Su oversaw the creation of the Galactic Republic's first clone armies. That effort gave his storm-swept homeworld influence in the Republic, but also made it a target of the Separatist military.",
        "databank_url": "http://starwars.wikia.com/wiki/Lama_Su"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Lando-Calrissian_a679fe1e.jpeg?region=89%2C0%2C1200%2C899",
        "name": "Lando Calrissian",
        "slug": "lando-calrissian",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars Rebels"
        ],
        "description": "Once a smooth-talking smuggler, Lando Calrissian changed from a get-rich-quick schemer to a selfless leader in the fight against the Empire. From adventures with the Ghost crew of rebels to the attack on Death Star II, his quick wit and daring proved to be invaluable.",
        "databank_url": "http://starwars.wikia.com/wiki/Lando_Calrissian"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Princess-Leia-Organa_d7761ff5.jpeg?region=322%2C0%2C1200%2C900",
        "name": "Leia Organa",
        "slug": "leia-organa",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Princess Leia Organa was one of the Rebel Alliance’s greatest leaders, fearless on the battlefield and dedicated to ending the tyranny of the Empire. Daughter of Padmé Amidala and Anakin Skywalker, sister of Luke Skywalker, and with a soft spot for scoundrels, Leia ranks among the galaxy’s great heroes. But life under the New Republic has not been easy for Leia. Sidelined by a new generation of political leaders, and struck out on her own to oppose the First Order as founder of the Resistance. These setbacks in her political career have been accompanied by more personal losses.",
        "databank_url": "http://starwars.wikia.com/wiki/Leia_Organa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_lobot_01_169_8a50d7ae.jpeg?region=314%2C0%2C1170%2C878",
        "name": "Lobot",
        "slug": "lobot",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "Never far from Baron Administrator Lando Calrissian's side was Lobot, Calrissian's aide and Cloud City's computer liaison officer. Lobot is a human male with a shiny, brain-enhancing device wrapped around the back of his skull that allowed him to contact directly with the city's central computer.",
        "databank_url": "http://starwars.wikia.com/wiki/Lobot"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/logray-main-image_05b9e023.jpeg?region=0%2C63%2C1560%2C1170",
        "name": "Logray",
        "slug": "logray",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "The shaman of the Ewok village, Logray's rituals ensured his tribe remained in harmony with Endor's forest spirits. When a golden god visited his planet, Logray ordered the sacrifice of offworlders in this deity's honor -- only to somehow incur the god's wrath. No one ever said faith was easy.",
        "databank_url": "http://starwars.wikia.com/wiki/Logray"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/lor-san-tekka_3ebccd38.jpeg?region=647%2C0%2C851%2C636",
        "name": "Lor San Tekka",
        "slug": "lor-san-tekka",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A legendary traveler and explorer, Lor San Tekka is a longtime ally of the New Republic and the Resistance. After the Battle of Endor, San Tekka helped Luke Skywalker recover secret Jedi lore that the Empire had tried to erase, and Leia Organa hopes the old scout can now help find her brother. Following decades of adventure, San Tekka retired to live simply on Jakku, where he follows the dictates of the once-forbidden Church of the Force. But his retirement is fated to be anything but peaceful.",
        "databank_url": "http://starwars.wikia.com/wiki/Lor_San_Tekka"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_lottdod_01_169_7219a66c.jpeg?region=0%2C0%2C1170%2C878",
        "name": "Lott Dod",
        "slug": "lott-dod",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "To hear Lott Dod tell it, the actions of Nute Gunray did not reflect the true intents of the Trade Federation, which remained loyal to the Galactic Republic. Sure, the Separatist Alliance did use Trade Federation starships and battle droids as part of their fighting forces in the Clone Wars, but this was equipment legitimately purchased in the open market. The Trade Federation was committed to commerce across the entire galaxy, and had no interest in getting caught up in territorial wars, Dodd would say. In truth, the Senator received a healthy income to ensure both sides of the war stay well equipped.",
        "databank_url": "http://starwars.wikia.com/wiki/Lott_Dod"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Luke-Skywalker_dd9c9f9b.jpeg?region=224%2C0%2C1152%2C864",
        "name": "Luke Skywalker",
        "slug": "luke-skywalker",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Luke Skywalker was a Tatooine farmboy who rose from humble beginnings to become one of the greatest Jedi the galaxy has ever known. Along with his friends Princess Leia and Han Solo, Luke battled the evil Empire, discovered the truth of his parentage, and ended the tyranny of the Sith. A generation later, the location of the famed Jedi master was one of the galaxy’s greatest mysteries.",
        "databank_url": "http://starwars.wikia.com/wiki/Luke_Skywalker"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/luminara_c05b2971.jpeg?region=239%2C0%2C1201%2C901",
        "name": "Luminara Unduli",
        "slug": "luminara-unduli",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars Rebels",
            "Star Wars: The Clone Wars"
        ],
        "description": "A green-skinned Mirialan, Luminara Unduli served the Jedi Order during the final years of the Galactic Republic, and trained the capable Padawan Barriss Offee. A no-nonsense Jedi Master, Luminara fought in Clone Wars battles such as Geonosis and Kashyyyk, and was thought to have perished during Order 66. In reality, she’d been taken into Imperial custody and executed, with holographic transmissions of her captivity used as bait to capture fugitive Jedi.",
        "databank_url": "http://starwars.wikia.com/wiki/Luminara_Unduli"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/lyn-me-main-image_9c02fdc3.jpeg?region=0%2C116%2C1560%2C1164",
        "name": "Lyn Me",
        "slug": "lyn-me",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A lithe Twi'lek dancer and singer, Lyn Me performed with the Max Rebo Band during the group's residence as Jabba the Hutt's house band. From the stage, Lyn Me got an up-close look at the depraved galactic underworld.",
        "databank_url": "http://starwars.wikia.com/wiki/Lyn_Me"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Mace-Windu_b35242e5.jpeg?region=236%2C0%2C1229%2C921",
        "name": "Mace Windu",
        "slug": "mace-windu",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "A grim Jedi Master with an amethyst-bladed lightsaber, Mace Windu was the champion of the Jedi Order, with little tolerance for the failings of the Senate, the arguments of politicians, or the opinions of rebellious Jedi. As the Clone Wars intensified, Mace sensed the dark side of the Force at work, and knew the Jedi's enemies were plotting to destroy the Order and end its stewardship of the galaxy.",
        "databank_url": "http://starwars.wikia.com/wiki/Mace_Windu"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/major-bren-derlin_9f3442b5.jpeg?region=86%2C0%2C1381%2C1035",
        "name": "Major Bren Derlin",
        "slug": "major-bren-derlin",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "A mustachioed rebel officer, Bren Derlin hailed from Tiisheraan. He served with Alliance Intelligence and was named security chief at Hoth’s Echo Base. Derlin reluctantly gave the order to close the base’s shield doors while Han Solo was out searching for Luke Skywalker. He survived the Battle of Hoth and led a rebel ground unit during the Battle of Endor.",
        "databank_url": "http://starwars.wikia.com/wiki/Major_Bren_Derlin"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/malakili_9da71dc4.jpeg?region=544%2C0%2C921%2C690",
        "name": "Malakili",
        "slug": "malakili",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A burly human, Malakili tended to Jabba the Hutt’s menagerie, including the galactic gangster’s prized pet rancor. Despite the rancor’s vicious nature, Malakili cared about the beast. He was shocked when Luke Skywalker killed his monstrous charge, and wept at its demise.",
        "databank_url": "http://starwars.wikia.com/wiki/Malakili"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/mas-amedda-main-image_756fa0ae.jpeg?region=0%2C97%2C827%2C620",
        "name": "Mas Amedda",
        "slug": "mas-amedda",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Mas Amedda was the Vice Chair of the Galactic Senate during Chancellor Valorum's term, a position he continued to hold as Chancellor Palpatine transformed the Republic into the Galactic Empire. Amedda's booming voice often called for order when the partisan nature of the Republic's government degenerated into pointless bickering. In an alien gesture of authority, he would often punctuate such calls with a flicker of his long, forked tongue.",
        "databank_url": "http://starwars.wikia.com/wiki/Mas_Amedda"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/mawhonic-main-image_7962bb16.jpeg?region=190%2C0%2C1370%2C1026",
        "name": "Mawhonic",
        "slug": "mawhonic",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "A Gran podracer, Mawhonic competed in the Boonta Eve Classic. Knowledgable podracing fans regarded him as one of the more capable challengers to Sebulba, the favorite in the hard-fought race. Sebulba wasted no time eliminating his Gran rival from the competition and smashed into Mawhonic's podracer on the first lap, knocking him out of the race.",
        "databank_url": "http://starwars.wikia.com/wiki/Mawhonic"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Max-Rebo_d4a6e06b.jpeg?region=739%2C0%2C2217%2C1662",
        "name": "Max Rebo",
        "slug": "max-rebo",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "Max Rebo was the heart (or at least the fluid sac) of the band that bore his name, and could be found onstage behind the pedals of his red ball organ. From there he kept an ear on his bandmates' playing and an eye on the sleazy clients who hired his ensemble for their entertainment.",
        "databank_url": "http://starwars.wikia.com/wiki/Max_Rebo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/maz-kanata_a5c3c8a5.jpeg?region=485%2C0%2C850%2C636",
        "name": "Maz Kanata",
        "slug": "maz-kanata",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Maz Kanata is more than a thousand years old, a diminutive being with vast experience at surviving in the underworld. From her castle on Takodana, Maz has seen galactic powers rise and fall and felt the Force ebb and flow, seeking an elusive balance between darkness and light. She has given many a young smuggler a start by offering credits, equipment or connections, and helped many an old friend rediscover a lost path.",
        "databank_url": "http://starwars.wikia.com/wiki/Maz_Kanata"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/me-8d9_d474afdc.jpeg?region=0%2C45%2C504%2C378",
        "name": "ME-8D9",
        "slug": "me-8d9",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "An ancient protocol droid of unknown manufacture, ME-8D9 has been a fixture at Maz’s castle on Takodana for many years. Pirates and smugglers often ask Emmie to serve as a translator for their shady negotiations. The droid has been reprogrammed numerous times, and her original purpose is unclear. She’s known to have served as an assassin, and some whisper that she began her long mechanical life with the Jedi Order.",
        "databank_url": "http://starwars.wikia.com/wiki/ME-8D9"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_meenatills_01_169_34912fb1.jpeg?region=138%2C0%2C1170%2C878",
        "name": "Meena Tills",
        "slug": "meena-tills",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "The watery world of Mon Cala was the site of a civil war during the Clone Wars, as the Mon Calamari people sided with the Republic, while the Quarren were backed by the Separatist Alliance. Senator Meena Tills was caught in the midst of this conflict, advising where she could while under the protection of the Jedi and clone troopers.     Later, Senator Tills was part of the Delegation of 2,000 -- Senatorial representatives concerned with the manner in which Chancellor Palpatine had waged the Clone Wars. The Petition of 2,000 identified Senators formally complaining on Palpatine's conduct, and requested that he return his emergency powers to the Senate following the resolution of the conflict.",
        "databank_url": "http://starwars.wikia.com/wiki/Meena_Tills"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_commanderjerjerrod_01_169_3e457b94.jpeg?region=154%2C122%2C962%2C721",
        "name": "Moff Jerjerrod",
        "slug": "moff-jerjerrod",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A chilly technocrat, Tiaan Jerjerrod was responsible for overseeing construction of the second Death Star above the forest moon of Endor. The task was difficult, to say the least -- Jerjerrod desperately needed more time and more resources. What he got instead was a visit from Darth Vader.",
        "databank_url": "http://starwars.wikia.com/wiki/Moff_Jerjerrod"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/momaw-nadon-2_a6fae2f8.jpeg?region=307%2C0%2C943%2C707",
        "name": "Momaw Nadon",
        "slug": "momaw-nadon",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "An exile from Ithor, Momaw Nadon was a rebel sympathizer who cultivated a hidden garden in the mountains south of Mos Eisley. Nadon was in the Mos Eisley Cantina when Luke Skywalker and Obi-Wan Kenobi arrived in search of a pilot who could take them to Alderaan without attracting Imperial attention.",
        "databank_url": "http://starwars.wikia.com/wiki/Momaw_Nadon"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_monmothma_01_169_b62808e8.jpeg?region=390%2C0%2C1170%2C878",
        "name": "Mon Mothma",
        "slug": "mon-mothma",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A leader of the Galactic Senate's Loyalist faction, Mon Mothma opposed Supreme Chancellor Palpatine's policies during the final days of the Repulic. Working in secret, she helped found the Rebel Alliance, and served as its civilian leader during the long struggle against the Empire.",
        "databank_url": "http://starwars.wikia.com/wiki/Mon_Mothma"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_niennunb_01_169_31eccf40.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Nien Nunb",
        "slug": "nien-nunb",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A jowled, mouse-eyed native of Sullust, Nien Nunb was an arms dealer and smuggler who piloted the Mellcrawler. After the Battle of Yavin, he helped Princess Leia smuggle an enclave of Alderaanian survivors off Sullust and then assisted the princess during the diversionary mission known as Operation Yellow Moon. Later, Nunb served Lando Calrissian’s co-pilot aboard the Millennium Falcon during the Battle of Endor. He spoke the liquid, chattering tongue of the Sullustans.",
        "databank_url": "http://starwars.wikia.com/wiki/Nien_Nunb"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_nutegunray_01_169_9d66ded2.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Nute Gunray",
        "slug": "nute-gunray",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Neimoidians are known for their business skills, but Nute Gunray, Viceroy of the Trade Federation, was more cutthroat than most. It was Gunray who conspired with the Sith Lord Darth Sidious to launch the blockade and subsequent invasion of Naboo. Once the planet was under siege, Gunray attempted to force Queen Amidala to sign a treaty that would legitimize the occupation. Amidala escaped, and returned to infiltrate her own palace and blast through Gunray's protectors. Arrested by Republic officials, Gunray was carted off to answer for his crimes, but evaded imprisonment and kept his post.",
        "databank_url": "http://starwars.wikia.com/wiki/Nute_Gunray"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Obi-Wan-Kenobi_6d775533.jpeg?region=48%2C0%2C1152%2C864",
        "name": "Obi-Wan Kenobi",
        "slug": "obi-wan-kenobi",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A legendary Jedi Master, Obi-Wan Kenobi was a noble man and gifted in the ways of the Force. He trained Anakin Skywalker, served as a general in the Republic Army during the Clone Wars, and guided Luke Skywalker as a mentor.",
        "databank_url": "http://starwars.wikia.com/wiki/Obi-Wan_Kenobi"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_odymandrell_01_169_39b1886d.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Ody Mandrell",
        "slug": "ody-mandrell",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "A Tatooine native, Ody Mandrell was a foolhardy thrill-seeker who entered the fateful Boonta Eve Classic that saw the liberation of Anakin Skywalker. During a pit stop in the heat of the race, Mandrell suffered career-shattering misfortune. One of his record-setting pit droids was sucked into his massive engine intakes, crippling his Podracer.",
        "databank_url": "http://starwars.wikia.com/wiki/Ody_Mandrell"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/onaconda_farr_5f82db19.jpeg?region=777%2C0%2C2175%2C1630",
        "name": "Onaconda Farr",
        "slug": "onaconda-farr",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "The Senator from Rodia, Onaconda Farr had long been a friend and ally to Padmé Amidala. Farr disappointed many when he briefly allied his world to the Separatist cause, but he saw the error of his ways and returned to the Republic fold with Amidala's help. Nonetheless, the damage was done, and some in the Senate were not willing to forgive and forget.",
        "databank_url": "http://starwars.wikia.com/wiki/Onaconda_Farr"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/oola-main-image_5c15a693.jpeg?region=184%2C0%2C878%2C658",
        "name": "Oola",
        "slug": "oola",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A green-skinned Twi'lek, Oola was one of Jabba's slaves, forced to dance for the Hutt's pleasure. When Oola resisted Jabba's orders one time too many, the cruel Hutt dropped her into the Rancor's cave beneath his throne room -- a one-way trip taken by many who no longer pleased the crimelord.",
        "databank_url": "http://starwars.wikia.com/wiki/Oola"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/oppo-rancisis-edited_c22ddc63.jpeg?region=213%2C0%2C1707%2C1279",
        "name": "Oppo Rancisis",
        "slug": "oppo-rancisis",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "A snakelike Thisspiasian, Oppo Rancisis's long life seeking to keep peace in the galaxy culminated in his appointment to the Jedi Council in the years before the Battle of Naboo.",
        "databank_url": "http://starwars.wikia.com/wiki/Oppo_Rancisis"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/ep2_ia_6235_6e9ad79a.jpeg?region=777%2C120%2C2295%2C1719",
        "name": "Orn Free Taa",
        "slug": "orn-free-taa",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A corpulent, corrupt Twi'lek Senator from Ryloth, Orn Free Taa was disliked on his homeworld for enriching himself on Coruscant and enmeshing himself in politics, becoming a leading power broker in the Senate.    Free Taa was one of the Republic's leading Loyalists and a strong backer of the military, but his indulgences made him a symbol of everything the Separatists considered rotten about the Republic.",
        "databank_url": "http://starwars.wikia.com/wiki/Orn_Free_Taa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_owenlars_01_169_effce0f8.jpeg?region=116%2C0%2C1170%2C878",
        "name": "Owen Lars",
        "slug": "owen-lars",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Owen Lars continued his father Cliegg’s efforts to build his homestead into a productive farm, working alongside his wife, Beru. Helping with the dreary chores required to keep the farm profitable, Owen relied on his nephew Luke Skywalker. He could not rein in Luke's drive for adventure, though. Young Skywalker longed to leave Tatooine and join the Imperial Academy, to live life among the stars. Owen forbade it, reminding Luke that he was needed on the moisture farm. Skywalker would eventually leave the farm, but under tragic circumstances. Imperials searching for missing droids razed the Lars homestead and killed Owen and Beru.",
        "databank_url": "http://starwars.wikia.com/wiki/Owen_Lars"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Padme-Amidala_05d50c8a.jpeg?region=205%2C0%2C1152%2C864",
        "name": "Padmé Amidala",
        "slug": "padme-amidala",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Padmé Amidala was a courageous, hopeful leader, serving as Queen and then Senator of Naboo -- and was also handy with a blaster. Despite her ideals and all she did for the cause of peace, her secret, forbidden marriage to Jedi Anakin Skywalker would prove to have dire consequences for the galaxy.",
        "databank_url": "http://starwars.wikia.com/wiki/Padmé_Amidala"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/passel-argente-main-image_f5e71c22.jpeg?region=0%2C315%2C1560%2C1172",
        "name": "Passel Argente",
        "slug": "passel-argente",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "The leader of a collection of powerful galactic companies, Passel Argente was one of the chief backers of Count Dooku's Separatist movement, supplying funds, battle droids and warships for Dooku's cause.",
        "databank_url": "http://starwars.wikia.com/wiki/Passel_Argente"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_plokoon_01_169_92e6679c.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Plo Koon",
        "slug": "plo-koon",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A Kel Dor from Dorin, Plo Koon was among the wisest members of the Jedi Order, respected for his level-headed analysis of events and unflappable calm. Deeply concerned for life in all its myriad forms, Plo was especially devoted to protecting the clones under his command. He shared a special bond with Ahsoka Tano, whom he’d brought to the Jedi Order as a toddler. One of many victims of Order 66, Master Plo died at Cato Neimoidia when his wingmen shot down his starfighter.",
        "databank_url": "http://starwars.wikia.com/wiki/Plo_Koon"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/po-nudo_fe655af2.jpeg?region=0%2C70%2C842%2C631",
        "name": "Po Nudo",
        "slug": "po-nudo",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Po Nudo was a male Aqualish whose allegiances to the Galactic Republic shifted over the course of his tenure in politics. At the time the Trade Federation invaded Naboo, he served in the Galactic Senate representing his homeworld of Ando, but met with Count Dooku and other Separatists on Geonosis on the eve of the Clone Wars to join their confederate cause. His involvement with the Sith ended poorly, as he was executed unceremoniously by Darth Vader on Mustafar in the final days of the war.",
        "databank_url": "http://starwars.wikia.com/wiki/Po_Nudo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/poe-dameron_70f5aee2.jpeg?region=268%2C11%2C967%2C726",
        "name": "Poe Dameron",
        "slug": "poe-dameron",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Poe Dameron is a commander in the Resistance’s Starfighter Corps and one of Leia Organa’s most-trusted operatives. The son of a rebel fighter pilot and a rebel commando, Poe grew up on stories of Alliance campaigns. A decorated X-wing pilot, he can fly anything – which is fortunate given how often his headstrong nature leads him into trouble.",
        "databank_url": "http://starwars.wikia.com/wiki/Poe_Dameron"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_pogglethelesser_01_169_7095ae3c.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Poggle the Lesser",
        "slug": "poggle-the-lesser",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Poggle the Lesser was the leader of the insect-like Geonosians throughout the era of the Clone Wars. Due to his control of the Geonosian battle droid factories, he was a powerful figure within the Confederacy of Independent Systems and commanded the droid armies that fought against the Republic in two battles for control of Geonosis. At the end of the war, Poggle lost his life to Darth Vader.",
        "databank_url": "http://starwars.wikia.com/wiki/Poggle_the_Lesser"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/ponda-baba-main-image_5addfeb7.jpeg?region=233%2C0%2C1094%2C818",
        "name": "Ponda Baba",
        "slug": "ponda-baba",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "A burly Aqualish thug, Ponda Baba smuggled spice for Jabba the Hutt alongside his friend Dr. Cornelius Evazan, a murderous former surgeon Ponda had rescued from a bounty hunter. Ponda was one of the alien barflies escaping the heat of Tatooine’s twin suns when Luke Skywalker and Obi-Wan Kenobi visited the Mos Eisley Cantina. Bored and looking for excitement, Ponda picked a fight with Luke, which Evazan quickly escalated. But the two bullies had picked the wrong target – Obi-Wan interceded, taking action when Ponda and Evazan refused to back down. The old Jedi’s lightsaber left Evazan dead and Ponda missing an arm, ending the quarrel rather decisively.",
        "databank_url": "http://starwars.wikia.com/wiki/Ponda_Baba"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/pz-4co_c67aa3b8.jpeg?region=0%2C0%2C1556%2C1167",
        "name": "PZ-4CO (Peazy-Fourseeo)",
        "slug": "pz-4co-peazy-fourseeo",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Built to resemble the long-necked Tofallid species, PZ-4CO is an invaluable intelligence droid based at the Resistance headquarters on D’Qar. Despite her hulking appearance, she speaks in a pleasant voice, offering tactical data and communications support during operations. “Peazy” and C-3PO often work together to monitor the Resistance’s galaxy-wide network of droid agents.",
        "databank_url": "http://starwars.wikia.com/wiki/PZ-4CO_(Peazy-Fourseeo)"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/queen_apailana_90cd9319.jpeg?region=393%2C0%2C888%2C665",
        "name": "Queen Apailana",
        "slug": "queen-apailana",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Queen Apailana was the elected ruler of the Naboo by the end of the Clone Wars. She was the first ruler of the Emperor’s home planet of Naboo during the birth of the Galactic Empire. She was seen publicly mourning Senator Padme Amidala at her funeral.",
        "databank_url": "http://starwars.wikia.com/wiki/Queen_Apailana"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/queen-breha-organa_4fecda83.jpeg?region=282%2C0%2C883%2C663",
        "name": "Queen Breha Organa",
        "slug": "queen-breha-organa",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Breha Organa was a human female from Alderaan and the monarch of that planet. She was married to Senator Bail Organa and together they adopted Princess Leia, one of the twins borne of the union between of Padme Amidala and Anakin Skywalker. As her husband worked to build the loose underground network of cells that would eventually become the rebel alliance, she would mentor students personally on Alderaan, including the X-wing pilot Evaan Verlaine. It is presumed that the queen perished on Alderaan when the entire planet was destroyed by the Empire’s super-weapon, the Death Star.",
        "databank_url": "http://starwars.wikia.com/wiki/Queen_Breha_Organa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/queen-jamillia_0cb29995.jpeg?region=325%2C0%2C1170%2C877",
        "name": "Queen Jamillia",
        "slug": "queen-jamillia",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "Queen Jamillia served as the successor of Queen Amidala as the elected sovereign of Naboo. It was Jamillia that convinced Padme Amidala to serve as senator for the system, and spoke with Padme about the political realities of war as the Senator hid on Naboo just prior to the outbreak of the Clone Wars.",
        "databank_url": "http://starwars.wikia.com/wiki/Queen_Jamillia"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Qui-Gon-Jinn_d89416e8.jpeg?region=59%2C0%2C1151%2C865",
        "name": "Qui-Gon Jinn",
        "slug": "qui-gon-jinn",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "A venerable if maverick Jedi Master, Qui-Gon Jinn was a student of the living Force. Qui-Gon lived for the moment, espousing a philosophy of \"feel, don't think -- use your instincts.\" On Tatooine, Qui-Gon discovered a young slave boy named Anakin Skywalker who was strong in the Force. Sensing the boy's potential, Qui-Gon liberated Anakin from slavery. The Jedi Master presented Anakin to the Jedi Council, but they deemed the boy too old to begin training and dangerously full of fear and anger. They refused to allow Qui-Gon to train Anakin, but rescinded their decision to fulfill Qui-Gon's dying wish.",
        "databank_url": "http://starwars.wikia.com/wiki/Qui-Gon_Jinn"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_quinlanvos_01_169_77d70d48.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Quinlan Vos",
        "slug": "quinlan-vos",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "A Jedi with a sarcastic sense of humor and a reputation for not playing by the rules, Quinlan Vos was an expert tracker renowned for his ability to read memories from objects people handled. The Jedi Council sent him on a mission to assassinate Count Dooku, during which Vos fell in love with the assassin Asajj Ventress and was forced to learn the ways of the dark side of the Force.",
        "databank_url": "http://starwars.wikia.com/wiki/Quinlan_Vos"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/R2-D2_41dacaa9.jpeg?region=315%2C0%2C1152%2C864",
        "name": "R2-D2",
        "slug": "r2-d2",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars",
            "Star Wars Rebels"
        ],
        "description": "A resourceful astromech droid, R2-D2 served Padmé Amidala, Anakin Skywalker and Luke Skywalker in turn, showing great bravery in rescuing his masters and their friends from many perils. A skilled starship mechanic and fighter pilot's assistant, he formed an unlikely but enduring friendship with the fussy protocol droid C-3PO.",
        "databank_url": "http://starwars.wikia.com/wiki/R2-D2"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/r4-p17_19602f62.jpeg?region=431%2C0%2C888%2C665",
        "name": "R4-P17",
        "slug": "r4-p17",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "R4-P17 was an astromech droid assigned to Obi-Wan Kenobi, and assisted the Jedi Master on many missions, from Kamino and Geonosis to Teth and Tatooine. She was destroyed during the Battle of Coruscant when buzz droids swarmed Obi-Wan’s fighter, ripping the faithful droid’s dome from her metal body.",
        "databank_url": "http://starwars.wikia.com/wiki/R4-P17"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/r5-d4_main_image_7d5f078e.jpeg?region=466%2C0%2C888%2C666",
        "name": "R5-D4",
        "slug": "r5-d4",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "A red astromech droid, R5-D4 thought he'd found a home when the Jawas sold him to Owen Lars, along with the protocol droid C-3PO. But R5's motivator blew as he rolled away from the sandcrawler, forcing the Jawas to take him back in exchange for R2-D2.",
        "databank_url": "http://starwars.wikia.com/wiki/R5-D4"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_rancor_01_169_251b682f.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Rancor",
        "slug": "rancor",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: The Clone Wars"
        ],
        "description": "Rancors are towering hulks of muscle and reptilian flesh that walk on two stubby legs and use their disproportionately long arms to capture prey. A salivating, tooth-filled maw dominates their flat faces, and their armored skin is so tough that they can shrug off blaster bolts as little more than annoyances. While not inherently vicious – Felucia’s farmers co-existed relatively peaceably with spined, brightly colored jungle rancors – these creatures were prized as trophies by crimelords and other wealthy, amoral individuals. Jabba the Hutt kept a rancor in a shadowy chamber beneath his Tatooine throne room. After Luke Skywalker killed the beast, an outraged Jabba ordered the public execution of the Jedi and his friends.",
        "databank_url": "http://starwars.wikia.com/wiki/Rancor"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/rappertunie-main-image_63c323f9.jpeg?region=92%2C0%2C1204%2C901",
        "name": "Rappertunie",
        "slug": "rappertunie",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A green-skinned Shawda Ubb, Rappertunie played a peculiar instrument known as a Growdi Harmonique. He used his fingers, toes and mouth to supplement the wall of sound that was the Max Rebo Band at full strength.",
        "databank_url": "http://starwars.wikia.com/wiki/Rappertunie"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_rattstyerell_01_169_031aea6d.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Ratts Tyerell",
        "slug": "ratts-tyerell",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Ratts Tyerell was the tiniest of the Podracer pilots in the Boonta Eve Classic, though size matters not in such a competition. The little scrapper piloted a Podracer with immense engines ... too big, it would seem, for the tight confines of the Laguna Caves. On the second lap of the race, Ratts' accelerator jammed, and he couldn't get clearance past the rocky stalactites. The resulting fireball killed the little guy. His family, who had traveled to Mos Espa to witness the race, was reportedly seen grieving shortly thereafter.",
        "databank_url": "http://starwars.wikia.com/wiki/Ratts_Tyerell"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/rey_bddd0f27.jpeg?region=0%2C10%2C1560%2C1170",
        "name": "Rey",
        "slug": "rey",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Rey is a Jakku scavenger, a survivor toughened by life on a harsh desert planet. When the fugitive droid BB-8 appeals to her for help, Rey finds herself drawn into a galaxy-spanning conflict. Despite dismissing herself as “no one,” she learns that her life is being shaped by the mysterious power of the Force.",
        "databank_url": "http://starwars.wikia.com/wiki/Rey"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_ricolie_01_169_f175f81b.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Ric Olie",
        "slug": "ric-olie",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "A veteran of the Naboo Space Fighter Corps, Ric Olie was the leader of Bravo Flight and had the honor of flying Queen Amidala's Royal Starship to and from Naboo. Answerable directly to Captain Panaka, Olie was capable of flying any craft on Naboo.    During the Battle of Naboo, Olie's squadron of N-1 starfighters were successful in destroying the Trade Federation's Droid Control Ship with the help of Anakin Skywalker.",
        "databank_url": "http://starwars.wikia.com/wiki/Ric_Olie"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/ep1_ia_18349_a13003fd.jpeg?region=198%2C0%2C2604%2C1953",
        "name": "Rune Haako",
        "slug": "rune-haako",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "A cowardly Neimoidian official, Rune Haako had no shortage of despair during the Trade Federation blockade and invasion of Naboo. As lieutenant to Viceroy Nute Gunray, Haako was privy to his superior's plans and knew of the mysterious Sith patron who was the true mastermind behind their bold maneuvers. Haako, when beyond Sith earshot, openly questioned Gunray's judgment in striking this terrifying alliance. When Queen Amidala retook her capital of Theed, Haako and Gunray were captured and sent to Coruscant for trial and punishment.",
        "databank_url": "http://starwars.wikia.com/wiki/Rune_Haako"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/rystall-sant-16-9_a7bfab45.jpeg?region=0%2C0%2C1170%2C878",
        "name": "Rystáll Sant",
        "slug": "rystall-sant",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "Half-human, half-Theelin, the crimson-haired Rystáll Sant performed with the Max Rebo Band in the group's more elaborate gigs. A veteran singer and dancer, Rystáll's hooves had twirled across many a stage during her galaxy-spanning career.",
        "databank_url": "http://starwars.wikia.com/wiki/Rystáll_Sant"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_sabe_01_169_45c104cd.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Sabé",
        "slug": "sabe",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Sabé is the most important of Queen Amidala's royal retinue of handmaidens. During crisis situations, Sabé and Amidala switch roles. Sabé becomes a decoy, disguised as the Queen, while Amidala adopts a simple gown of a handmaiden, and goes by her less formal name of Padmé Naberrie. When in this role, Sabé and Padmé secretly communicate with subtle signals as to not divulge their true identities. During the Trade Federation invasion of Naboo, Sabé posed as the Queen on several occasions.",
        "databank_url": "http://starwars.wikia.com/wiki/Sabé"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_saeseetiin_01_169_c9a8a41c.jpeg?region=181%2C0%2C1170%2C878",
        "name": "Saesee Tiin",
        "slug": "saesee-tiin",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "The imposing Saesee Tiin was a member of the Jedi Council during the final years of the Republic. In addition to being a skilled, courageous master of the lightsaber, he was also a capable starfighter pilot.  Tiin voyaged to Naboo to attend the funeral of fallen Jedi Qui-Gon Jinn, and the jubilant celebration that marked the liberation of that outlying world. Ten years after this event, Tiin was still an active member of the Jedi order, and a vital battlefield general in the Clone Wars.",
        "databank_url": "http://starwars.wikia.com/wiki/Saesee_Tiin"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/image_da9047cc.jpeg?region=56%2C0%2C1142%2C858",
        "name": "Salacious B. Crumb",
        "slug": "salacious-crumb",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A Kowakian monkey-lizard with a shrill cackle, Salacious Crumb sat on Jabba's dais, stealing bits of food and mimicking the Hutt, his courtiers, and visitors. The Hutt's noxious pet was the palace's unofficial court jester, tolerated because his antics amused Jabba, and because of his unwavering support for his master.",
        "databank_url": "http://starwars.wikia.com/wiki/Salacious_B._Crumb"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/san-hill_852a226d.jpeg?region=555%2C0%2C883%2C661",
        "name": "San Hill",
        "slug": "san-hill",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "San Hill was a male Muun who was the chairman of the InterGalactic Banking Clan at the onset of the Clone Wars and signed Count Dooku’s treaty. He served as the IG representative on the Separatist Council until he was murdered unceremoniously by the Sith Lord Darth Vader shortly after the end of the war.",
        "databank_url": "http://starwars.wikia.com/wiki/San_Hill"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/fullsizerender_0b0d8a33.jpeg?region=0%2C0%2C1245%2C936",
        "name": "Sarco Plank",
        "slug": "sarco-plank",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "An eyeless insectoid member of the Melitto species, Sarco Plank is an amoral scavenger, bounty hunter and arms dealer who does business in Niima Outpost on Jakku. During the Galactic Civil War he made a living as a tomb raider, once serving as a guide for a young Luke Skywalker on Devaron. Sarco dueled Skywalker with his electrostaff, an encounter that left the scavenger with a near-fatal lightsaber wound and a healthy respect for Jedi abilities.",
        "databank_url": "http://starwars.wikia.com/wiki/Sarco_Plank"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/sebulba_1f3fe180.jpeg?region=5%2C0%2C1840%2C1380",
        "name": "Sebulba",
        "slug": "sebulba",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "A crafty, vicious Dug, Sebulba became one of the Outer Rim's most successful Podracers. Whether roaming the streets of Mos Espa or piloting his massive orange Podracer, Sebulba was aggressive and arrogant. He was not above cheating to win a race, and would even resort to illegal weapons in an attempt to defeat his opponents. Sebulba was Mos Espa's reigning Podrace champion until he entered the Boonta Eve Classic, where he was defeated by young Anakin Skywalker, much to the Dug's frustration.",
        "databank_url": "http://starwars.wikia.com/wiki/Sebulba"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/shaak_ti_9523e7c7.jpeg?region=353%2C0%2C1080%2C809",
        "name": "Shaak Ti",
        "slug": "shaak-ti",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A wise and patient Jedi Master, the Togruta Shaak Ti fought at the Battle of Geonosis, and supervised the training of clone cadets on Kamino. There, she struggled to balance the necessity of producing capable troopers with compassion for the clones as living beings. Ti helped defend Kamino against Separatist attack, balancing assignments in the field with her duties on the Jedi Council.",
        "databank_url": "http://starwars.wikia.com/wiki/Shaak_Ti"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_shmiskywalkerlars_01_169_7449f0a8.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Shmi Skywalker Lars",
        "slug": "shmi-skywalker-lars",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "The mother of Anakin Skywalker was also a brave and resilient woman who survived life as a slave to become a Tatooine moisture farmer. Shmi surrendered her son to the Jedi Order, putting him on a path to become one of the greatest Jedi. Her death at the hands of Tusken Raiders became a critical step on Anakin's journey to the dark side.",
        "databank_url": "http://starwars.wikia.com/wiki/Shmi_Skywalker_Lars"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/shu-mai_9b9f994e.jpeg?region=279%2C0%2C1154%2C866",
        "name": "Shu Mai",
        "slug": "shu-mai",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Shu Mai is a female Gossam from planet Castell who uses her influence as the Presidente of the Commerce Guild to gain a seat on the Separatist Council. She pledged her support for the Confederacy in secret meetings on Geonosis just prior to the start of the Clone War, but it was this allegiance that eventually led to her death on the planet Mustafar at the hands of Darth Vader.",
        "databank_url": "http://starwars.wikia.com/wiki/Shu_Mai"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Sifo-Dyas_3f37cee4.jpeg?region=753%2C0%2C1087%2C816",
        "name": "Sifo-Dyas",
        "slug": "sifo-dyas",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "A member of the Jedi Council before the blockade of Naboo, Sifo-Dyas believed the galaxy would soon be plunged into war, and agitated for the Republic to create an army for its defense. After the other Jedi rejected his ideas and removed him from the council, he secretly contacted the Kaminoans and commissioned them to create a clone army, which he led the Kaminoans to believe was for the Republic. In doing so, Sifo-Dyas became an unwitting pawn of the Sith, who took over the project and hired the Pyke Syndicate to murder Sifo-Dyas on Oba Diah’s moon. A decade after Sifo-Dyas’ death, Obi-Wan Kenobi discovered the army he had commissioned, now ready for duty. The Jedi took control of this army on Supreme Chancellor Palpatine’s orders, setting the Clone Wars in motion.",
        "databank_url": "http://starwars.wikia.com/wiki/Sifo-Dyas"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/sim-aloo_3f41aa36.jpeg?region=0%2C221%2C799%2C598",
        "name": "Sim Aloo",
        "slug": "sim-aloo",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "Sim Aloo was a skeletal looking human clad in flowing purple robes and wore an impressive hat. He served as one of Emperor Palpatine’s closest advisors during the time of the Galactic Empire. He traveled with the Emperor to the second Death Star to oversee the final stages of its construction over Endor. Presumably, he was still aboard when the Death Star was destroyed by the Rebellion.",
        "databank_url": "http://starwars.wikia.com/wiki/Sim_Aloo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_siobibble_01_169_68afc1e9.jpeg?region=0%2C0%2C1170%2C878",
        "name": "Sio Bibble",
        "slug": "sio-bibble",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "Sio Bibble was the outspoken governor of Naboo. When the Trade Federation brazenly blockaded the trade routes to the small pastoral world, Bibble was among the first to suspect invasion. His suspicions proved correct. Bibble, like the rest of the Naboo citizenry, was taken captive by the mechanized armies of the Trade Federation.    Queen Amidala fled to Coruscant with the help of Jedi ambassadors to secure aid from Senator Palpatine. Bibble stayed behind, to placate the Neimoidian invaders and to represent the besieged people. Nute Gunray delighted in toying with Bibble, taunting him about the dire state of the Naboo populace.    After Naboo was liberated, Bibble attended the parade celebrating the newfound freedom.",
        "databank_url": "http://starwars.wikia.com/wiki/Sio_Bibble"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/snap-wexley-1_7527625d.jpeg?region=174%2C0%2C1386%2C1042",
        "name": "Snap Wexley",
        "slug": "snap-wexley",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "Temmin “Snap” Wexley is a pilot in Blue Squadron known as the best recon flier in the Resistance’s Starfighter Corps. Snap grew up on the Outer Rim world of Akiva, the son of a rebel Y-wing pilot who flew in the Battle of Endor. His recon flight of Starkiller Base helps the Resistance come up with a plan to destroy the First Order superweapon.",
        "databank_url": "http://starwars.wikia.com/wiki/Snap_Wexley"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/stass-allie_cbfbe9a1.jpeg?region=0%2C90%2C938%2C701",
        "name": "Stass Allie",
        "slug": "stass-allie",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "A Tholothian member of the Jedi Council, Stass Allie served as a Jedi General during the Clone Wars, beginning with the Jedi mission to rescue Obi-Wan Kenobi and Anakin Skywalker from execution on Geonosis. Stass led clone troopers into battle on many worlds, culminating with the Outer Rim Sieges. She was piloting her BARC speeder on Saleucami when Darth Sidious issued Order 66 to her wingman, Commander Neyo. Obeying orders, Neyo and another clone trooper dropped behind Stass and blew her speeder bike out of the sky.",
        "databank_url": "http://starwars.wikia.com/wiki/Stass_Allie"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/valorum_a31904f4.jpeg?region=412%2C0%2C1273%2C955",
        "name": "Supreme Chancellor Valorum",
        "slug": "supreme-chancellor-valorum",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: The Clone Wars"
        ],
        "description": "A well-meaning civil servant whose chancellorship was hampered by corruption in the Senate and bureaucratic snarls, Valorum secretly turned to the Jedi Knights for help breaking the Trade Federation's blockade of Naboo.    But Valorum was betrayed by Naboo's Senator Palpatine, who maneuvered Queen Amidala into asking the Senate for a no-confidence vote in the Supreme Chancellor's leadership. A stunned Valorum was removed from office in favor of Palpatine.",
        "databank_url": "http://starwars.wikia.com/wiki/Supreme_Chancellor_Valorum"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/snoke_72696f58.jpeg?region=379%2C0%2C851%2C636",
        "name": "Supreme Leader Snoke",
        "slug": "supreme-leader-snoke",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "The Supreme Leader of the First Order, the mysterious Snoke has no permanent base of operations, preferring to contact his underlings from a mobile command post. Snoke is powerful with the dark side of the Force, and seduced Kylo Ren into abandoning the Jedi path to become his apprentice. But Snoke also commands General Hux and the technological war machine the First Order has engineered to destroy the New Republic and Leia Organa’s Resistance.",
        "databank_url": "http://starwars.wikia.com/wiki/Supreme_Leader_Snoke"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Sy-Snootles_c524452d.jpeg?region=592%2C122%2C905%2C678",
        "name": "Sy Snootles",
        "slug": "sy-snootles",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: The Clone Wars"
        ],
        "description": "Sy Snootles, a long-limbed Pa'lowick, was a popular singer and dancer whose patrons included Jabba the Hutt. Very few realized that she also worked as a spy for the Hutt criminal cartels, and that she betrayed her love, Ziro the Hutt, in exchange for a big payday.",
        "databank_url": "http://starwars.wikia.com/wiki/Sy_Snootles"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/tarrful_f20d3412.jpeg?region=514%2C0%2C840%2C630",
        "name": "Tarfful",
        "slug": "tarfful",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars"
        ],
        "description": "A massive Wookiee general, Tarfful helped defend his native Kashyyyk during the Clone Wars. A distress signal brought Tarfful and his most trusted warriors rushing to Chewbacca's help against the hated Trandoshans on the hunting grounds of Wasskah. Later, Tarfful and Chewbacca fought side by side with General Yoda on the battlegrounds of Kashyyyk.",
        "databank_url": "http://starwars.wikia.com/wiki/Tarfful"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/tasu-leech_15b293df.jpeg?region=87%2C0%2C1387%2C1040",
        "name": "Tasu Leech",
        "slug": "tasu-leech",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "The leader of the Kanjiklub, Tasu Leech is a brutal street fighter. Leech grew up on the Hutt colony world of Nar Kanji and refuses to speak Basic, dismissing it as a “soft language for soft people” and preferring to let his Huttsplitter blaster rifle do the talking. Leech and his fighters confront Han Solo aboard his bulk freighter, angry that the Corellian has twice failed to deliver promised cargo.",
        "databank_url": "http://starwars.wikia.com/wiki/Tasu_Leech"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_taunwe_01_169_9b9e8eb9.jpeg?region=219%2C0%2C1170%2C878",
        "name": "Taun We",
        "slug": "taun-we",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "A beautiful sylph-like Kaminoan, Taun We is the administrative aide to the Prime Minister of Kamino, Lama Su. When Obi-Wan Kenobi arrived at the rain-swept platforms of Tipoca City, he was greeted by the gentle Taun We.    Taun We explained that the Kaminoans had long been expecting the arrival of a Jedi envoy, since a Jedi representative, Master Sifo-Dyas, commissioned a clone army a decade earlier. Kenobi bluffed his way into the heart of the cloning operation, and had the naive Taun We introduce him to the original source of the clones, Jango Fett.",
        "databank_url": "http://starwars.wikia.com/wiki/Taun_We"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/tc-14_08341508.jpeg?region=289%2C231%2C1030%2C774",
        "name": "TC-14",
        "slug": "tc-14",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "TC-14 was a protocol droid with feminine programming that was in the employ of the Trade Federation on their Profiteer-class droid control ship Saak’ak. She showed Obi-wan Kenobi and Qui-Gon Jinn to a conference room where she offered them refreshments as they waited for the Trade Federation to murder the Jedi with the toxic gas Dioxis.",
        "databank_url": "http://starwars.wikia.com/wiki/TC-14"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/teckla-minnau_fdfa2fef.jpeg?region=677%2C0%2C883%2C664",
        "name": "Teckla Minnau",
        "slug": "teckla-minnau",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: The Clone Wars"
        ],
        "description": "Teckla Minnau was a human female from Naboo who served as an aide to Senator Padme Amidala during the time just prior to the Clone Wars and through the war. She served in many capacities and was an important sounding board for the Senator. She accompanied Amidala on her mission to Scipio and took part in the ruse to expose the InterGalactic Banking Clan’s fraud, but was killed by the sniper shot of the bounty hunter Embo.",
        "databank_url": "http://starwars.wikia.com/wiki/Teckla_Minnau"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/teebo_48370833.jpeg?region=0%2C268%2C1560%2C1166",
        "name": "Teebo",
        "slug": "teebo",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "An Ewok scout, Teebo led the hunting party that captured Han Solo, Chewbacca, Luke Skywalker, C-3PO and R2-D2 in a net. Disliking the look of Solo, Teebo gave him several pokes with a spear. He then brought his captives back to Bright Tree Village to be cooked for a banquet in C-3PO’s honor. R2-D2, objecting to this treatment, shocked Teebo repeatedly once freed. Teebo sounded the horn summoning the Ewoks to fight the stormtroopers, and made amends with Artoo after the rebel victory.",
        "databank_url": "http://starwars.wikia.com/wiki/Teebo"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/teemto-pagalies_140af421.jpeg?region=87%2C0%2C1387%2C1040",
        "name": "Teemto Pagalies",
        "slug": "teemto-pagalies",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Teemto Pagalies was a flamboyant, hilarious, and handsome Veknoid podracer from Moonus Mandel. Though he was an outcast on his homeworld, he found fame racing pods. During the Boonta Eve Classic won by Anakin Skywalker, Teemto’s IPG-X1131 LongTail was sniped off the course by those pesky Tusken Raiders camped out on the Canyon Dune turn. Despite the horrible crash, he survived to race another day.",
        "databank_url": "http://starwars.wikia.com/wiki/Teemto_Pagalies"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_tionmedon_01_169_bf78864d.jpeg?region=276%2C0%2C1170%2C878",
        "name": "Tion Medon",
        "slug": "tion-medon",
        "appearances": [
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "Greeting Obi-Wan Kenobi during his search for General Grievous on windswept Utapau was Port Administrator Tion Medon. The tall, gaunt Utapaun initially feigned ignorance about Grievous' whereabouts, but then whispered a warning to Kenobi. Grievous was indeed on the planet, hiding on the tenth level of the sinkhole city with an army of thousands of battle droids.",
        "databank_url": "http://starwars.wikia.com/wiki/Tion_Medon"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/unkar-plutt_4cd0610b.jpeg?region=87%2C0%2C1387%2C1040",
        "name": "Unkar Plutt",
        "slug": "unkar-plutt",
        "appearances": [
            "Star Wars: Episode VII The Force Awakens"
        ],
        "description": "A hulking Crolute, Unkar Plutt is the junkboss of Jakku, doling survival rations out to scavengers in return for salvage from the Graveyard of Ships. The ruthless Unkar uses hired muscle to enforce his stranglehold on barter, sending his thugs to punish any scavenger who dares dabble in unauthorized trades or negotiates too aggressively. The Blobfish – as scavengers call him behind his broad back -- has collected all matter of weapons, gears and ships over the years, including a battered Corellian freighter he keeps under a tarp on the outskirts of Niima Outpost.",
        "databank_url": "http://starwars.wikia.com/wiki/Unkar_Plutt"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/wa-7-main-image-2_7807ab42.jpeg?region=222%2C0%2C883%2C661",
        "name": "WA-7",
        "slug": "wa-7",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "A sassy waitress droid, WA-7 kept plates coming and tables clean in Dexter's Diner, a comfy greasy spoon on Coruscant. Nicknamed FLO, she always had a friendly greeting for regulars -- provided they didn't overload her circuits with attitude or make her repeat the specials.",
        "databank_url": "http://starwars.wikia.com/wiki/WA-7"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_wald_01_169_d1cf2fdd.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Wald",
        "slug": "wald",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "Wald was one of Anakin's playmates in the Mos Espa Slave Quarters. He and Kitster, along with the droids R2-D2 and C-3PO, formed Anakin's pit team at the Boonta Eve Classic Podrace. At the time, Wald was six years old.",
        "databank_url": "http://starwars.wikia.com/wiki/Wald"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_watto_01_169_ecd563f1.jpeg?region=141%2C0%2C1170%2C878",
        "name": "Watto",
        "slug": "watto",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "Watto was a Toydarian junk dealer in Mos Espa who bought Shmi Skywalker and her son Anakin from Gardulla the Hutt. An inveterate gambler, he sponsored Anakin in several Podraces, but often bet against his own slave, who was talented but inexperienced.    Watto lost Anakin to Qui-Gon Jinn in a wager on the Boonta Eve race. Years later, he sold Shmi to the moisture farmer Cliegg Lars.",
        "databank_url": "http://starwars.wikia.com/wiki/Watto"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_wedgeantilles_01_169_b8185dce.jpeg?region=241%2C0%2C1170%2C878",
        "name": "Wedge Antilles",
        "slug": "wedge-antilles",
        "appearances": [
            "Star Wars: Episode IV A New Hope",
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "A talented young rebel pilot from Corellia, Wedge Antilles survived the attack on the first Death Star to become a respected veteran of Rogue Squadron. He piloted a snowspeeder in the defense of Echo Base on Hoth, and led Red Squadron in the rebel attack on the second Death Star above Endor.",
        "databank_url": "http://starwars.wikia.com/wiki/Wedge_Antilles"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/wes-janson_e193b62f.jpeg?region=683%2C0%2C877%2C658",
        "name": "Wes Janson",
        "slug": "wes-janson",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "A native of Taanab, Wes Janson joined the Alliance and was assigned to Hoth’s Echo Base. During the Battle of Hoth, Lieutenant Janson served as tail gunner for Wedge Antilles under the call sign Rogue Three. After the AT-AT walkers’ armor proved too strong for blasters, Janson and Antilles were the first pilots to try Luke Skywalker’s risky strategy of using harpoons and tow cables to trip up the Imperial war machines.",
        "databank_url": "http://starwars.wikia.com/wiki/Wes_Janson"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_wickettwwarrick_01_169_86d1210c.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Wicket W. Warrick",
        "slug": "wicket-w-warrick",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "Wicket W. Warrick was the brave young Ewok who willingly joined the Rebellion and aided in the battle against the Empire on the forest moon of Endor. Even before he encountered the Rebels, Wicket had devised methods for defeating the Imperial machines, plans which were implemented after the Ewok befriended Princess Leia and recruited his tribe to the Alliance's cause. During the Battle of Endor, Wicket fought valiantly alongside his new allies.",
        "databank_url": "http://starwars.wikia.com/wiki/Wicket_W._Warrick"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/wuher-main-image_883bdea2.jpeg?region=0%2C48%2C800%2C602",
        "name": "Wuher",
        "slug": "wuher",
        "appearances": [
            "Star Wars: Episode IV A New Hope"
        ],
        "description": "You didn’t survive in the Mos Eisley Cantina by being nice, and Wuher was a survivor. The gruff bartender dispensed drinks to the spacers, moisture farmers and barflies escaping the Tatooine heat; did his best to enforce the seedy bar’s handful of rules (no droids and no settling fights with blasters); and avoided trouble, whether it began with trigger-happy patrons or stormtroopers investigating the latest incident.",
        "databank_url": "http://starwars.wikia.com/wiki/Wuher"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/databank_yaddle_01_169_3cfd7068.jpeg?region=195%2C0%2C1171%2C878",
        "name": "Yaddle",
        "slug": "yaddle",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "The quiet Yaddle was a member of the same mysterious species as the revered Jedi Master Yoda. Yaddle sat on the Jedi Council with her fellow green-skinned diminutive Force-user. By the time of the Clone Wars, she was no longer on the Council.",
        "databank_url": "http://starwars.wikia.com/wiki/Yaddle"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/screen_shot_2015-08-03_at_10_b0b47660.jpeg?region=0%2C382%2C1560%2C1171",
        "name": "Yarael Poof",
        "slug": "yarael-poof",
        "appearances": [
            "Star Wars: Episode I The Phantom Menace"
        ],
        "description": "A gaunt, long-necked Quermian, Yarael Poof had two brains and four arms, which he kept hidden beneath his Jedi robes. Poof was a member of the Jedi Council during the final years of the Republic, and was in the Jedi Council Chamber when Qui-Gon Jinn returned from Tatooine with the extraordinary news that the ancient Sith had returned to challenge the Jedi once more.",
        "databank_url": "http://starwars.wikia.com/wiki/Yarael_Poof"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/yarna-main-image_d95b36c6.jpeg?region=0%2C0%2C1422%2C1066",
        "name": "Yarna d'al' Gargan",
        "slug": "yarna-d-al-gargan",
        "appearances": [
            "Star Wars: Episode VI Return of the Jedi"
        ],
        "description": "One of Jabba's many possessions, the ample Yarna d'al' Gargan served the Hutt as a dancing girl. Yarna's slower, more deliberate moves across the throne room floor formed a contrast to those of the slimmer, younger Oola.",
        "databank_url": "http://starwars.wikia.com/wiki/Yarna_d'al'_Gargan"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/Yoda-Retina_2a7ecc26.jpeg?region=333%2C0%2C1152%2C864",
        "name": "Yoda",
        "slug": "yoda",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back",
            "Star Wars: Episode VI Return of the Jedi",
            "Star Wars: Episode I The Phantom Menace",
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith",
            "Star Wars: The Clone Wars",
            "Star Wars Rebels"
        ],
        "description": "Yoda was a legendary Jedi Master and stronger than most in his connection with the Force. Small in size but wise and powerful, he trained Jedi for over 800 years, playing integral roles in the Clone Wars, the instruction of Luke Skywalker, and unlocking the path to immortality.",
        "databank_url": "http://starwars.wikia.com/wiki/Yoda"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/zam-wesell_bbaffe9f.jpeg?region=200%2C0%2C883%2C664",
        "name": "Zam Wesell",
        "slug": "zam-wesell",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones"
        ],
        "description": "A shape-shifting Clawdite assassin from Zolan, Zam Wesell could assume any humanoid form. Jango Fett hired her to kill Padmé Amidala on Coruscant, but the Naboo Senator eluded an explosive that destroyed her starship, then escaped poisonous kouhuns let loose in her apartment. Anakin Skywalker and Obi-Wan Kenobi pursued Zam across Coruscant, catching her in the Outlander Club. Before she could talk, Jango shot her dead with a Kaminoan saberdart.",
        "databank_url": "http://starwars.wikia.com/wiki/Zam_Wesell"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/zett-jukassa_0eb7f414.jpeg?region=374%2C0%2C888%2C665",
        "name": "Zett Jukassa",
        "slug": "zett-jukassa",
        "appearances": [
            "Star Wars: Episode II Attack of the Clones",
            "Star Wars: Episode III Revenge of the Sith"
        ],
        "description": "A young Padawan, Zett Jukassa fought heroically after clone troopers marched on the Jedi Temple to carry out Order 66. He fell in battle as a horrified Bail Organa looked on.",
        "databank_url": "http://starwars.wikia.com/wiki/Zett_Jukassa"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/e5s_key_105_6eda70be.jpeg?region=256%2C0%2C760%2C570",
        "name": "Zev Senesca",
        "slug": "zev-senesca",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "Zev was a rebel pilot assigned to Echo Base on the frozen planet Hoth. Flying a snowspeeder as Rogue Two, he located Han Solo and Luke Skywalker after the two went missing during a perilous blizzard. Zev then flew with Rogue Squadron in the Battle of Hoth, but blasts from an AT-AT walker ripped through his snowspeeder, killing him.",
        "databank_url": "http://starwars.wikia.com/wiki/Zev_Senesca"
    },
    {
        "image": "http://img.lum.dolimg.com/v1/images/zuckuss-main-image_af4f3e42.jpeg?region=0%2C188%2C1289%2C963",
        "name": "Zuckuss",
        "slug": "zuckuss",
        "appearances": [
            "Star Wars: Episode V The Empire Strikes Back"
        ],
        "description": "A Gand bounty hunter, Zuckuss heeded the Empire's call for mercenaries to locate the Millennium Falcon and bring her fugitive crew to justice, receiving his orders on the bridge of Darth Vader's Super Star Destroyer.",
        "databank_url": "http://starwars.wikia.com/wiki/Zuckuss"
    }
]